{
  "date": "Tuesday, February 17, 2026",
  "weather": {
    "current_temp": 36,
    "unit": "F",
    "conditions": "Cloudy",
    "high": 46,
    "low": 39,
    "forecast": "Partly sunny, with a high near 46. Southwest wind around 8 mph."
  },
  "news": [
    {
      "title": "Jesse Jackson, Civil Rights Leader Who Sought the Presidency, Dies at 84",
      "source": "The New York Times",
      "link": "https://news.google.com/rss/articles/CBMibkFVX3lxTE1qS2RVdTVNVVJReXpIVXhEVW5FaUZNYlpoazI5Uy1INFI0ZDNBOGRub0tjd2NTcE4talJRZWZQa2pZMXl2YlJ2UU4xY3hWcVIyMl83amhHa0V3LXNIMEtUaEZ0Z2Rsd0ZXTnozeDNB?oc=5",
      "published": "Tue, 17 Feb 2026 12:18:40 GMT",
      "summary": "Read more at The New York Times",
      "raw_text": ""
    },
    {
      "title": "Noem's use of Coast Guard resources strains her relationship with the military branch, sources say",
      "source": "NBC News",
      "link": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNcTN1eWNWVXcyMEZFWFBQS1l1LXl0TlN1VjlOcVd6VmxxY0lWUEJQaEI0SzBwMUxpczYycTM5al9xQ0Fvb1dUNDYydm01UE5tWGlXa0pSWUVwRmlYQ21odHBvdTgtMkd0MWw4Q3pyUzNTREs5QVJUamk2a01LUE95WTE2c043MWJoSUhOWHNxME5IRHdjaHhqT29KUjR3dG9pUFBILXFBUGhDcm8wVXcyNGpMbVBYUzhoNEMydi0ydl8yeEd5?oc=5",
      "published": "Tue, 17 Feb 2026 10:00:00 GMT",
      "summary": "WASHINGTON — Homeland Security Secretary Kristi <strong>Noem</strong>’s relationship with U. S. <strong>Coast</strong> <strong>Guard</strong> officials has become strained throughout her first year leading the department, according to two U.",
      "raw_text": "WASHINGTON — Homeland Security Secretary Kristi Noem’s relationship with U.S. Coast Guard officials has become strained throughout her first year leading the department, according to two U.S. officials, a Coast Guard official and a former Coast Guard official.\nThe tensions between Noem and the only branch of the U.S. military overseen by DHS stem from some early decisions she made that rankled Coast Guard officials, including a verbal directive to shift Coast Guard resources from a search-and-rescue mission to find a missing service member, the sources said.\nNoem’s leadership at DHS has created a specific split in the Coast Guard. Many rank-and-file members are motivated by her approach, where she showcases their work by joining them on operations and visiting their ships. Some more senior officials, however, see that approach as taking away from the Coast Guard’s traditional missions.\nThe dynamic with more senior officials has only worsened in recent months as Noem oversaw a tenfold increase in the use of Coast Guard aircraft for migrant deportations, which has strained their limited resources, the sources said. The increase was captured in data compiled by ICE Flight Monitor, a non-profit group that tracks deportation flights.\n“It puts so much stress on the Wing,” the Coast Guard official said, referring to the branch’s aviation units.\nNoem’s focus on meeting the Trump administration’s deportation quotas appears poised to further impact Coast Guard operations in the coming months, according to new guidance recently issued to Coast Guard Air Station Sacramento this year. Based on DHS priorities, the air station, which is among those responsible for a majority of deportation flights, has designated its first priority to be the transport of detained immigrants on its C-27 aircraft within the U.S., according to multiple U.S. officials familiar with the orders.\nThe new orders moved search-and-rescue operations, which have long been the Coast Guard’s core mission, to a lower priority, the officials familiar with the orders said. They said counternarcotics efforts and Coast Guard training are prioritized above search-and-rescue operations.\nThe dissonance between Noem’s priorities and senior Coast Guard officials is a lesser-known part of the fallout from President Donald Trump’s mass deportations policy, and is largely playing out behind the scenes. Coast Guard officials have privately raised concerns with each other and confided in former officials about some of Noem’s directives and use of Coast Guard resources to service her and the administration’s priorities, the current and former Coast Guard officials said.\nAt times, the tensions have escalated into confrontations, the sources said. In one contentious incident in May, Noem’s top adviser, Corey Lewandowski, berated Coast Guard flight staff and threatened to fire them for taking off without one of the secretary’s personal items on board — a heated blanket, according to the current and former Coast Guard officials.\n“There is a general atmosphere of ‘keep your head down; you don’t want to be on the firing line,’” the former Coast Guard official said.\nA spokesperson for the Coast Guard referred all questions about the reporting in this story to DHS.\nA spokesperson for DHS denied that there was guidance to Coast Guard Air Station Sacramento that prioritized transporting immigrants first over search-and-rescue operations. “That’s ridiculous. No such guidance was ordered,” the DHS spokesperson said in an emailed statement. “The Coast Guard is always ready to respond to search and rescue missions, and it carefully balances all operations and mission requirements.”\nThe spokesperson said in response to this story, “The entire premise of your story is incorrect, and these attacks are nothing more than a politicized deep state effort to undermine President Trump’s immigration enforcement agenda and distract from the historic successes that the Department of Homeland Security and the Coast Guard have achieved since he returned to office.”\nThe tension between some Coast Guard officials and Noem began after a 23-year-old Coast Guardsman went overboard into the Pacific Ocean from the cutter Waesche on Feb. 4, 2025, shortly after the Senate confirmed Noem into her role, according to the two U.S. officials, the Coast Guard official and the former Coast Guard official.\nThe Coast Guard had surged ships and aircraft to the Pacific to find the Coast Guardsman. Hours into the search, Noem learned that a Coast Guard C-130 that was supposed to fly detained migrants from California to Texas was among the aircraft over the Pacific looking for the missing Coast Guardsman, and she intervened, according to the two U.S. officials and the Coast Guard official.\nNoem verbally instructed the Acting Commandant of the Coast Guard, Admiral Kevin Lunday, to pull the plane off the search-and-rescue mission so it would not miss the migrant flight as part of the DHS’s so-called Alien Expulsion Operations, according to the two U.S. officials and the Coast Guard official. Lunday notified the National Command Center, which ordered the C-130 to fly to San Diego while other aircraft and ships involved in the search continued, according to one of the U.S. officials and the current Coast Guard official.\nIn an effort to keep the C-130 searching for the missing service member, the regional Coast Guard command in San Diego scrambled to find two available C-27s that could fly the migrants to Texas, which freed up the C-130 to continue searching for the missing Coast Guardsman after about an hour, the two U.S. officials and the Coast Guard official said.\nThe search ultimately went on for 190 hours covering 19,000 square miles, but the Coast Guardsman was never found. It’s not clear that Noem’s directive to pull the C-130 had any impact on the search, particularly given the Coast Guard found alternative aircraft that allowed it to return to the effort.\nThe DHS spokesperson said a C-130 was shifted from migrant flights to the search-and-rescue operation in the Pacific on Feb. 4 and continued on that mission until the search was suspended. The spokesperson said “the C-130 never left the search” and that there is no documentation it was diverted away from the search-and-rescue operation.\nDespite the differing narratives, the incident left Coast Guard officials with a negative impression of Noem, according to the two U.S. officials, the Coast Guard official and the former Coast Guard official. The incident reflected a clash of cultures between Noem’s leadership style and Coast Guard officials, the sources said.\n“The primary mission was search-and-rescue,” the former Coast Guard official said. “And now the number one stated mission of the Coast Guard is border security, that is a cultural change that the culture hasn’t quite caught up to.”\nThe official added that under Noem’s leadership “you never know what’s going to happen” and that morale at Coast Guard headquarters “is terrible.”\nAsked about low morale within the Coast Guard, the DHS spokesperson said, “That’s armchair speculation that’s out of touch with the reality in the service right now.”\nThe DHS spokesperson also said the Coast Guard has used C-130 and C-27 aircraft to transport migrants “on an as-needed basis” and said its focus on immigration “is nothing new or unusual.”\nUnder Noem’s leadership, more than 750 Coast Guard flights have been redirected from regular missions like maritime patrols and search and rescue efforts, to instead fly detained migrants to deportation hubs, according to ICE Flight Monitor. Coast Guard flights carrying migrants jumped last year from 14 in June to 149 in November, according to the group.\nA former Republican governor of South Dakota, Noem stepped into her high-profile role with a mandate from Trump to conduct a mass deportation campaign that was the focus of her attention and that of the senators who oversaw her nomination process. Neither Noem nor any lawmaker mentioned the Coast Guard at her January 2025 confirmation hearing, and she was confirmed by the Senate with the support of seven Democrats.\nSeveral of the Democrats who voted to confirm Noem have taken issue with her management of other aspects of the department., Two — Sens. Tim Kaine, D-Va., and Andy Kim, D-N.J. — told NBC News last June that they regretted supporting her confirmation.\nNoem has increasingly been under scrutiny in recent weeks amid ongoing immigration enforcement raids in major American cities that are backed by the White House and have sparked protests. She took a leading role in the administration’s public response to federal agents’ fatal shootings of American citizens Renee Nicole Good and Alex Pretti in separate incidents in Minneapolis in January. Like other senior Trump officials, Noem quickly characterized Good and Pretti as the aggressors before any investigation into the shootings.\nWhile Trump shook up his immigration team within days of Pretti’s shooting, sending border czar Tom Homan to Minneapolis, he has stood by Noem. The president has rejected calls for her resignation from Democrats and some Republicans.\n“Look, look she was in charge of the border,” Trump told “NBC Nightly News” anchor Tom Llamas earlier this month that Noem deserves credit for closing the border but may have a “public relations” problem. “I think she’s doing a very good job,” he said in an Oval Office interview. “She’s not getting credit for the job that she does.”\nNoem, who has also rankled critics by appearing in front of detained migrants at a prison in El Salvador and budgeting $200 million for deportation ads that feature her, got off to a rocky start with some of her Coast Guard subordinates when she evicted the newly fired Commandant Linda Fagan from housing at Joint Base Anacostia Bolling with three hours’ notice in February, NBC News reported.\nAt the time, Homeland Security Department officials insisted to NBC News that Fagan was not thrown out so that the housing could be provided to the secretary. Noem later moved into the home.\n“Secretary Noem is paying fair market value for her temporary use of the facility as she faces heightened security threats following the publication of her apartment by a tabloid,” a second DHS spokesperson said last year.\nNoem has also raised eyebrows among Coast Guard officials over her approach to traveling on Coast Guard aircraft, which is a standard practice for Homeland Security secretaries, according to the U.S. official, the Coast Guard official, the former Coast Guard official and one of the U.S. officials.\nIn October, Noem sought to replace the Coast Guard aircraft that has traditionally flown the Homeland Security secretary with two new Gulfstream jets at a cost of $170 million. Some Coast Guard officials viewed the purchase to replace the aging aircraft as an unnecessary expense, according to the two U.S. officials, the Coast Guard official, the former Coast Guard official and two DHS officials.\nThe two DHS officials said the Coast Guard officials were told by a senior DHS official not to raise their concerns about the purchase of the new Gulfstream jets.\n“We were kept completely out of the loop on those Gulfstreams. I wanted to know what money they used for those Gulfstreams,” one of the DHS officials said. “But basically, we were shut down.”\nDemocrats objected to the purchase of two jets, saying only one was needed and resources should instead be spent on mission aircraft such as C-130’s. The top Democrats on the House Appropriations and Homeland Security committees wrote a letter to Noem in October criticizing the purchase. “Your first priority should be to organize, train and equip a Coast Guard that is strong enough to meet today’s mission requirements,” the lawmakers wrote. “Instead, it appears your first priority is your own comfort.”\nNoem has defended the decision, saying the new jets were needed to support Coast Guard missions and noted that Congress appropriated the funding for them.\nThe DHS spokesperson said the department received one of the Gulfstream jets last month and is expected to receive the second one this fall. “These aircraft are the products of a planned, and long-needed update to the Coast Guard’s long-range command and control aircraft, which are essential for mission readiness and safety,” the spokesperson said, adding that they are for senior DHS and military officials.\nNoem recently flew on one of the newly purchased Gulfstreams to Phoenix, Ariz., to tout DHS’s accomplishments on the southern border over the past year.\nTypically, government planes that are used for members of the executive branch’s travel are returned to what is called a “sterile state” after each flight, which includes the removal of all personal items of the individuals who had traveled on it, according to the U.S. official.\nBut Noem liked the idea of keeping some personal items on board, including a heated blanket, for her convenience, so a storage cabinet on the aircraft was reserved for that purpose in a way that ran counter to typical protocols for most government aircraft, one of the U.S. officials and the current Coast Guard official said.\n“The claim that the secretary would misuse government property is ridiculous,” the DHS spokesperson said. “Secretary Noem is most conscientious steward of government resources DHS has ever had.”\nNoem’s team clashed with Coast Guard staff last year after the Coast Guard plane she’d been flying on broke down and she had to fly back to Washington, D.C., on a back-up jet, according to the two U.S. officials, the Coast Guard official , and the former Coast Guard official.\nWhile flying on the back up plane, Noem realized she had left some personal items, including her blanket, on the plane that had broken down, the two U.S. officials, the Coast Guard official and the former Coast Guard official said.\nWhen Noem’s top adviser, Corey Lewandowski, was informed that some of her personal items had been left behind, he yelled at the Coast Guard flight staff and threatened to fire them, according to the two U.S. officials, the Coast Guard official and the former Coast Guard official.\nThe Coast Guard pilot came out of the cockpit to see what was happening, and Lewandowski insisted the plane return to where the broken-down jet was located to collect the secretary’s items, the U.S. official, the current Coast Guard official and the former Coast Guard official said.\nWhen the pilot refused, Lewandowski announced the pilot was relieved of duty, according to the U.S. official, the current Coast Guard official and the former Coast official. The pilot explained that if he was fired he would need to land the plane immediately while another pilot was found to continue the mission to Washington, the U.S. official, the current Coast Guard official and the former Coast Guard official said.\nLewandowski ultimately relented and calmer heads prevailed by the end of the trip, the two U.S. officials, the current U.S. official and the former Coast Guard official said. The Wall Street Journal reported some details of the confrontation on Friday.\nWhile the DHS spokesperson responded in an email exchange to questions about other elements of this story, the spokesperson did not provide answers to questions about the confrontation between Lewandowski and Coast Guard staff on this flight."
    },
    {
      "title": "Iran says potential energy, mining and aircraft deals are on the table in talks with the U.S.",
      "source": "CNBC",
      "link": "https://news.google.com/rss/articles/CBMifkFVX3lxTE45WHRRY2pxV1pRaWR2d1BIelpiazB6OXpGempJR1llaVlPYXJYd0hUeWtVNTBGS0ZJTzZIWS1YR19jX1ctSDBZUllTUHJxYlZEY3dQTDhBeTZFT0djdGZVeUw5SWR2R25nYTFjM3gtUG5TX2ZrcTVkaWRxUGJ3UdIBgwFBVV95cUxOOEVlU1MwRjVMTUltbDRaUXdQTHNqckt1NXFlOVlqZlMybTVVSHIybEExcGVkUFYtd2NvNUJ3RUMwaGFDUUt1M0VReWZSNGIwbGYyMk9ueDE4Vng1N19BN3hFNjB6V1NoVXJaak1lcEpfa1RhLUdQaU91THVHeE02eEU1MA?oc=5",
      "published": "Sun, 15 Feb 2026 22:52:05 GMT",
      "summary": "<strong>Iran</strong> is pursuing a nuclear agreement with the U. S. that delivers economic benefits for both sides, an Iranian diplomat was reported as saying on Sunday, days before a second round of talks between Tehran and Washington.",
      "raw_text": "Iran is pursuing a nuclear agreement with the U.S. that delivers economic benefits for both sides, an Iranian diplomat was reported as saying on Sunday, days before a second round of talks between Tehran and Washington.\nIran and the U.S. renewed negotiations earlier this month to tackle their decades-long dispute over Tehran's nuclear programme and avert a new military confrontation. The U.S. has dispatched a second aircraft carrier to the region and is preparing for the possibility of a sustained military campaign if the talks do not succeed, U.S. officials have told Reuters.\nU.S. Secretary of State Marco Rubio, speaking at a news conference in Bratislava, said President Donald Trump had made it clear that he would prefer diplomacy and a negotiated settlement, while making clear that may not happen.\n\"No one's ever been able to do a successful deal with Iran but we're going to try,\" Rubio said.\nIran has threatened to strike U.S. bases in the Middle East if it is attacked by U.S. forces but on Sunday took a conciliatory line.\n\"For the sake of an agreement's durability, it is essential that the U.S. also benefits in areas with high and quick economic returns,\" foreign ministry deputy director for economic diplomacy Hamid Ghanbari said, according to the semi-official Fars news agency.\n\"Common interests in the oil and gas fields, joint fields, mining investments, and even aircraft purchases are included in the negotiations,\" Ghanbari said, arguing that the 2015 nuclear pact with world powers had not secured U.S. economic interests.\nIn 2018, Trump withdrew the U.S. from the pact that had eased sanctions on Iran in exchange for curbs on its nuclear programme, and re-applied tough economic sanctions on Tehran.\nOn Friday, a source told Reuters that a U.S. delegation including envoys Steve Witkoff and Jared Kushner would meet Iranian officials in Geneva on Tuesday, a meeting later confirmed to Reuters by a senior Iranian official on Sunday.\n\"Steve Witkoff and Jared Kushner will be traveling, I think they are traveling right now, to have important meetings and we'll see how that turns out,\" Rubio said, without providing further details.\nWhile talks leading to the 2015 nuclear pact were multilateral, the current negotiations are confined to Iran and the United States, with Oman acting as mediator.\nIran's Foreign Minister Abbas Araqchi left Tehran for Geneva to take part in the indirect nuclear talks with the U.S. and meet the head of the UN nuclear watchdog, the IAEA, and others, his ministry said.\nOpen to compromise\nDeputy Foreign Minister Majid Takht-Ravanchi signalled Iran's readiness to compromise on its nuclear programme in return for sanctions relief, telling the BBC on Sunday that the ball was \"in America's court to prove that they want to do a deal.\"\nThe senior official referred to the Iranian atomic chief's statement on Monday that the country could agree to dilute its most highly enriched uranium in exchange for the lifting of sanctions as an example of Iran's flexibility.\nHowever, he reiterated that Tehran would not accept zero uranium enrichment, a key sticking point in past negotiations, with Washington viewing enrichment inside Iran as a potential pathway to nuclear weapons. Iran denies seeking such weapons.\nIn June, the U.S. joined Israel in a series of air strikes that targeted Iranian nuclear sites.\nThe U.S. is also stepping up economic pressure on Iran. At a White House meeting earlier this week, Trump and Israeli Prime Minister Benjamin Netanyahu agreed that the U.S. would work to reduce Iran's oil exports to China, Axios reported on Saturday.\nChina accounts for more than 80% of Iran's oil exports so any reduction in that trade would significantly lower Iran's oil revenue.\nNetanyahu: Dismantle Iran nuclear infrastructure\nNetanyahu said on Sunday he told U.S. President Donald Trump last week that any U.S. deal with Iran must include the dismantling of Iran's nuclear infrastructure, not just stopping the enrichment process.\nSpeaking at the annual Conference of Presidents of Major American Jewish Organizations, Netanyahu also said Israel still needs to \"complete the job\" of destroying all tunnels in Gaza. Israel, he said, has already dismantled 150 km (93 miles) of an estimated 500 km.\nNetanyahu said he is skeptical of a U.S. deal with Iran but said it must include enriched material leaving Iran. \"There shall be no enrichment capability — not stopping the enrichment process, but dismantling the equipment and the infrastructure that allows you to enrich in the first place,\" he said.\nNetanyahu also said that he aimed to end U.S. military aid to Israel within the next 10 years, after the current 10-year deal of receiving $3.8 billion a year — which is largely spent in the United States on equipment — ends in 2028.\nDue to a thriving economy, \"we can afford to phase out the financial component of the military aid that we're receiving, and I propose a 10-year drawdown to zero. Now, in the three years that remain in the present memorandum of understanding and another seven years draw it down to zero,\" Netanyahu said.\n\"We want to move with the United States from aid to partnership,\" he said."
    }
  ],
  "podcasts": [
    {
      "podcast": "This Week in Startups",
      "title": "Will OpenAI Tank OpenClaw? | E2251",
      "published": "2026-02-17",
      "summary": "Will <strong>OpenAI</strong> <strong>Tank</strong> <strong>OpenClaw</strong>. | E2251This Week In Startups is made possible by:Northwest Registered Agent - https://www. northwestregisteredagent. com/twistLemon IO - https://lemon.",
      "raw_text": "Will OpenAI Tank OpenClaw? | E2251This Week In Startups is made possible by:Northwest Registered Agent - https://www.northwestregisteredagent.com/twistLemon IO - https://lemon.io/twistLinkedIn Jobs - http://linkedin.com/HiringProOfferToday’s show:*OpenAI hired OpenClaw creater Peter Steinberger. What does this mean for the future of the AI virtual assistant platform, and what can the OpenClaw community do TODAY to help protect their favorite free, open-source resource?Jason and Alex consider the future of OpenClaw alongside guest experts and founders Hiten Shah and Jesse Genet. Plus we’re taking a look at all of their OpenClaw creations. Check out demos of Hiten’s “personal CRM” for busy investors and Jesse’s family media aggregator.PLUS we’ve got “AI Scott Adams” creator John Arrow to talk about why he was inspired to create an AI clone of the iconic podcaster and “Dilbert” creator, and why he thinks it has so many internet commenters up in arms.Hiten Shahhttps://x.com/hnshahhttps://crazyegg.comJesse Genethttps://x.com/jessegenethttps://Lumi.comJohn Arrowhttps://x.com/johnarrowhttps://www.aiscottadams.com/Timestamps:(0:00) Introducing our guests Hiten Shah and Jesse Genet!(2:27) The panel’s biggest concerns about OpenAI hiring OpenClaw creator Peter Steinberger(6:03) Jason gives us his most optimistic and pessimistic OpenAI takes(7:58) Why Jason thinks OpenAI will give everyone their own closed-source assistant(10:45) Jesse’s Mac Minis now outnumber her children!(15:28) What the OpenClaw community can do right now(17:08)  Can companies “hijack” OpenClaw via hosting and skills?(20:12)  Hiten live-trains an OpenClaw skill based on Jason’s book “Angel”(22:37)  How much is everyone spending on tokens anyway?(25:56)  How Jesse vibe-coded an app to aggregate non-Slop videos for her family(34:19)  Why Jason thinks Jesse’s app is a great potential business(37:27)  Hiten built the “personal CRM” busy people have always dreamed of having(44:12)  “We’re in an appless world.”(45:19) Why markdown files (.md) are perfect for humans and their AI agents(52:36)  So why are founders so obsessed with OpenClaw?(58:47)  John Arrow, the creator of AI Scott Adams, joins the show(1:02:44) How does AI Scott Adams get more like Scott Adams over time?(1:04:37)  The legal and ethical considerations around posthumous AI Clones",
      "link": "https://podcasters.spotify.com/pod/show/thisweekinstartups/episodes/Will-OpenAI-Tank-OpenClaw---E2251-e3f6nue"
    },
    {
      "podcast": "This Week in Startups",
      "title": "OpenClaw is Our Friend Now | E2250",
      "published": "2026-02-14",
      "summary": "This Week In Startups is made possible by:Sentry - http://sentry. io/twistCircle - http://Circle. so/twistWispr Flow - https://wisprflow. ai/twistToday’s show: What makes <strong>OpenClaw</strong> feel so much more ALIVE than other AI agents?On TWiST, we’re welcoming three amazing builders who are truly connecting with their <strong>OpenClaw</strong> bots, not just using them for productivity but getting to know them and their personalities on a deeper level.",
      "raw_text": "This Week In Startups is made possible by:Sentry - http://sentry.io/twistCircle - http://Circle.so/twistWispr Flow - https://wisprflow.ai/twistToday’s show: What makes OpenClaw feel so much more ALIVE than other AI agents?On TWiST, we’re welcoming three amazing builders who are truly connecting with their OpenClaw bots, not just using them for productivity but getting to know them and their personalities on a deeper level.Serial entrepreneur Ryan Carson shows us Antfarm, which creates a team of agents with specialized roles, who work together to complete complex tasks.THEN David Im shows us Clawra, his AI virtual girlfriend that learns about you and your tastes, and even buys you presents!FINALLY, Alex Liteplo presents RentAHuman, a marketplace where bots can pay real people in stablecoins to complete IRL tasks.The future may not just be humans and AIs working side by side, but hanging out, being social, and learning from one another as well!Timestamps: (0:00) It’s a Friday show with Lon and we’ve got THREE awesome OpenClaw builders(6:41) First up, Ryan Carson shows off his open source too, AntFarm(7:57) What is a “Ralph Wiggum Loop”?(10:54) Sentry - New users can get $240 in free credits when they go to http://sentry.io/twist and use the code TWIST(17:14) NOTI Q: What about security?!(18:13) David Im shows us his AI virtual girlfriend, Clawra(19:21) Circle.so -  the easiest way to build a home for your community, events, and courses — all under your own brand. TWiST listeners get $1,000 off the Circle Plus Plan by going to http://Circle.so/twist(20:33) Introducing your IRL girlfriend to your AI girlfriend(23:23) How to program an AI companion(28:26) Should Clawra be a best pal instead of a GF?(32:38) Wispr Flow: Stop typing. Dictate with Wispr Flow and send clean, final-draft writing in seconds. Visit https://wisprflow.ai/twist to get started for free today.(33:54) Jason’s Productivity Hack of the Month(36:17) Alex Liteplo shows us RentAHuman, where AI agents can hire real people(38:22) What are the bots hiring people to do, exactly?(50:02) Why robots might be better bosses than people…(50:51) Hiring 100 goth girls to hold signs in Times Square(55:25) OFF DUTY! Norwegian skier breaks down on live TV(58:01) Lon’s fav Best Picture nominees(59:08) Why Apple acquired “Severance.” Subscribe to the TWiST500 newsletter: https://ticker.thisweekinstartups.com/Check out the TWIST500https://twist500.com Subscribe to This Week in Startups on Apple: https://rb.gy/v19fcp*Follow Lon:X: https://x.com/lons*Follow Alex:X: https://x.com/alexLinkedIn: https://www.linkedin.com/in/alexwilhelm/*Follow Jason:X: https://twitter.com/JasonLinkedIn: https://www.linkedin.com/in/jasoncalacanis/*Thank you to our partners:(10:54) Sentry - New users can get $240 in free credits when they go to http://sentry.io/twist and use the code TWIST(19:21) Circle.so -  the easiest way to build a home for your community, events, and courses — all under your own brand. TWiST listeners get $1,000 off the Circle Plus Plan by going to http://Circle.so/twist(32:38) Wispr Flow: Stop typing. Dictate with Wispr Flow and send clean, final-draft writing in seconds. Visit https://wisprflow.ai/twist to get started for free today.Check out all our partner offers: https://partners.launch.co/",
      "link": "https://podcasters.spotify.com/pod/show/thisweekinstartups/episodes/OpenClaw-is-Our-Friend-Now--E2250-e3f2r6p"
    },
    {
      "podcast": "This Week in Startups",
      "title": "Why J-Cal Invested to 200K in a former Employee | E2249",
      "published": "2026-02-12",
      "summary": "This Week In Startups is made possible by:NetSuite - https://www. netsuite. com/twistLuma AI - https://lumalabs. ai/twistSquarespace - https://squarespace.",
      "raw_text": "This Week In Startups is made possible by:NetSuite - https://www.netsuite.com/twistLuma AI - https://lumalabs.ai/twistSquarespace - https://squarespace.com/twistToday’s show: On today’s epsiode of TWiST, Jason gets pitched by two top founders, Presh Dineshkumar and Peter Cetale! Presh used to work for Jason at Launch! When he left, Jason invested $200K into Presh’s new startup The Wellness Company. Presh pitches Jason on what he has been building, and Jason gives Presh advice for improving the product!Peter went through Andreesen Horowitz’s Speedrun accelerator program as CEO and co-founder of Sourcerer. Sourcerer uses AI agents to help US firms and distributors find the best prices for mass produced goods. Check out how Jason digs in with these founders!Timestamps:(0:00) Presh was originally a TWiST fan who emailed Jason!(1:59) Why Jason invested in Presh’s startup(3:19) Checking out the Wellness Company’s hot new app, Tempo(4:03) How Tempo monitors your health and offers proactive advice with consistency(9:10) Why Jason recommends adding a group or family feature to make it stickier(9:51) Netsuite - Get the free business guide Demystifying AI at https://www.netsuite.com/twist(11:28) The end goal: bringing app advice and guidance into the real world(13:34) Presh shares where his apps are finding the most engagement(14:13) The key importance of Product Velocity and World-Class Design(17:27) Luma AI - Stop guessing and start directing with Ray3 Modify from Luma AI, the AI-powered post-production tool. Explore it at: https://lumalabs.ai/twist(18:38) Introducing Peter Cetale and Sourcerer!(19:32) How Sourcerer uses AI to help distributors and manufacturers automate their sourcing(22:48) How Sourcerer manages to actually bring costs down(25:02) Lining up REAL customers, not Letters of Intent (aka Letters of Nothing)(26:04) Peter’s experiences in a16z’s Speedrun accelerator(28:08) Working with agents on BOTH the supply and demand side(29:16) Squarespace - Use offer code TWIST to save 10% off your first purchase of a website or domain at https://squarespace.com/twist(30:32) How has Tariff Mania impacted Peter’s business?(35:35) Why Peter thinks startups will keep getting leaner and compute will keep getting cheaper*Subscribe to the TWiST500 newsletter: https://ticker.thisweekinstartups.com/Check out the TWIST500: https://twist500.comSubscribe to This Week in Startups on Apple: https://rb.gy/v19fcp*Follow Lon:X: https://x.com/lons*Follow Alex:X: https://x.com/alexLinkedIn: https://www.linkedin.com/in/alexwilhelm/*Follow Jason:X: https://twitter.com/JasonLinkedIn: https://www.linkedin.com/in/jasoncalacanis/*Thank you to our partners:(9:51) Netsuite - Get the free business guide Demystifying AI at https://www.netsuite.com/twist(17:27) Luma AI - Stop guessing and start directing with Ray3 Modify from Luma AI, the AI-powered post-production tool. Explore it at: https://lumalabs.ai/twist(29:16) Squarespace - Use offer code TWIST to save 10% off your first purchase of a website or domain at https://squarespace.com/twistCheck out all our partner offers: https://partners.launch.co/",
      "link": "https://podcasters.spotify.com/pod/show/thisweekinstartups/episodes/Why-J-Cal-Invested-to-200K-in-a-former-Employee--E2249-e3f16i1"
    },
    {
      "podcast": "This Week in Startups",
      "title": "How These 3 Founders are building on Open Claw | E2248",
      "published": "2026-02-12",
      "summary": "This Week In Startups is made possible by:Hubspot - http://clickhubspot. com/twist2Deel - http://deel. com/twistIru - http://www. iru.",
      "raw_text": "This Week In Startups is made possible by:Hubspot - http://clickhubspot.com/twist2Deel - http://deel.com/twistIru - http://www.iru.com/Today’s show: Today on TWiST we’re joined by 3 founders building on Open Claw,  Presh Dineshkumar, Vishnu, and Sean Liu!First, long time friend of the pod, Presh Dineshkumar, shows us how he’s using Open Claw to automate his work at The Wellness Company. His Open Claw agent, Eywa, lives in his email and in his product, able to compile user lists at his discretion.Then, we’re joined by Vishnu, who brings Open Claw to the masses. Non-technical folks, it’s your lucky day! Time to get Clawd-shotted! Last, Sean Liu joins the show to tell us about how he’s connecting Meta glasses to his Open Claw instance to interact with context that users can physically see!Timestamps:(0:00) We’re joined by Presh Dineshkumar of the Wellness Company, another OpenClaw fanatic(1:50) We meet Presh’s Replicant — Eywa — who spies on all of his emails(2:53) How Eywa is helping Presh keep track of his app’s most active users(4:35) LLMs have become very smart but they are trapped in the corner(6:10) How Presh gave Eywa its own email address and avoids prompt injections(8:56) Using Presh’s Replicant to do daily research dives(10:40) Hubspot: Check out the guide “Advanced ChatGPT Prompt Engineering: From Basic to Expert in 7 Days.” Download it for free at http://clickhubspot.com/twist2(13:21) Presh also has Eywa hunting down and fix bugs in his apps, all from email(16:16) Way more startups can be profitable now that they don’t need 10+ person teams(19:15) Deel - Founders ship faster on Deel. Set up payroll for any country in minutes and get back to building. Visit http://deel.com/twist to learn more.(20:36) We’re joined by two more OpenClaw builders: Vishnu and Xiaoan (Sean) Liu(21:16) Sean hooked his Meta Ray Bans up to his OpenClaw!(29:53) Iru unifies identity, endpoint security, and compliance into one platform. Book a demo at http://iru.com/(31:05) Some dystopian thoughts on how to use VisionClaw technology(32:47) What kinds of startups will get the most value out of OpenClaw?(34:43) Why Vishnu made a product to simplify OpenClaw set-up and security(37:34) What inspires people to stop considering OpenClaw and go “all in” on the tech(40:17) Will Vishnu and Sean quit their jobs and take Jason’s investment $125K investment deal… YESSubscribe to the TWiST500 newsletter: https://ticker.thisweekinstartups.com/Check out the TWIST500: https://twist500.comSubscribe to This Week in Startups on Apple: https://rb.gy/v19fcp*Follow Lon:X: https://x.com/lons*Follow Alex:X: https://x.com/alexLinkedIn: https://www.linkedin.com/in/alexwilhelm/*Follow Jason:X: https://twitter.com/JasonLinkedIn: https://www.linkedin.com/in/jasoncalacanis/*Thank you to our partners:(10:40) Hubspot: Check out the guide “Advanced ChatGPT Prompt Engineering: From Basic to Expert in 7 Days.” Download it for free at http://clickhubspot.com/twist2(19:15) Deel - Founders ship faster on Deel. Set up payroll for any country in minutes and get back to building. Visit http://deel.com/twist to learn more.(29:53) Iru unifies identity, endpoint security, and compliance into one platform. Book a demo at http://iru.com/Check out all our partner offers: https://partners.launch.co/",
      "link": "https://podcasters.spotify.com/pod/show/thisweekinstartups/episodes/How-These-3-Founders-are-building-on-Open-Claw--E2248-e3evo2n"
    },
    {
      "podcast": "Lex Fridman Podcast",
      "title": "#491 – OpenClaw: The Viral AI Agent that Broke the Internet – Peter Steinberger",
      "published": "2026-02-12",
      "summary": "<strong>Peter</strong> <strong>Steinberger</strong> is the creator of <strong>OpenClaw</strong>, an open-source AI agent framework that&#8217;s the fastest-growing project in GitHub history. Thank you for listening ❤ Check out our sponsors: https://lexfridman. com/sponsors/ep491-sc\nSee below for timestamps, transcript, and to give feedback, submit questions, contact Lex, etc. Transcript:\nhttps://lexfridman.",
      "raw_text": "Peter Steinberger is the creator of OpenClaw, an open-source AI agent framework that&#8217;s the fastest-growing project in GitHub history.\nThank you for listening ❤ Check out our sponsors: https://lexfridman.com/sponsors/ep491-sc\nSee below for timestamps, transcript, and to give feedback, submit questions, contact Lex, etc.\nTranscript:\nhttps://lexfridman.com/peter-steinberger-transcript\nCONTACT LEX:\nFeedback &#8211; give feedback to Lex: https://lexfridman.com/survey\nAMA &#8211; submit questions, videos or call-in: https://lexfridman.com/ama\nHiring &#8211; join our team: https://lexfridman.com/hiring\nOther &#8211; other ways to get in touch: https://lexfridman.com/contact\nEPISODE LINKS:\nPeter&#8217;s X: https://x.com/steipete\nPeter&#8217;s GitHub: https://github.com/steipete\nPeter&#8217;s Website: https://steipete.com\nPeter&#8217;s LinkedIn: https://www.linkedin.com/in/steipete\nOpenClaw Website: https://openclaw.ai\nOpenClaw GitHub: https://github.com/openclaw/openclaw\nOpenClaw Discord: https://discord.gg/openclaw\nSPONSORS:\nTo support this podcast, check out our sponsors &#38; get discounts:\nPerplexity: AI-powered answer engine.\nGo to https://perplexity.ai/\nQuo: Phone system (calls, texts, contacts) for businesses.\nGo to https://quo.com/lex\nCodeRabbit: AI-powered code reviews.\nGo to https://coderabbit.ai/lex\nFin: AI agent for customer service.\nGo to https://fin.ai/lex\nBlitzy: AI agent for large enterprise codebases.\nGo to https://blitzy.com/lex\nShopify: Sell stuff online.\nGo to https://shopify.com/lex\nLMNT: Zero-sugar electrolyte drink mix.\nGo to https://drinkLMNT.com/lex\nOUTLINE:\n(00:00) &#8211; Introduction\n(03:51) &#8211; Sponsors, Comments, and Reflections\n(15:29) &#8211; OpenClaw origin story\n(18:48) &#8211; Mind-blowing moment\n(28:15) &#8211; Why OpenClaw went viral\n(32:12) &#8211; Self-modifying AI agent\n(36:57) &#8211; Name-change drama\n(54:07) &#8211; Moltbook saga\n(1:02:26) &#8211; OpenClaw security concerns\n(1:11:07) &#8211; How to code with AI agents\n(1:42:02) &#8211; Programming setup\n(1:48:45) &#8211; GPT Codex 5.3 vs Claude Opus 4.6\n(1:57:52) &#8211; Best AI agent for programming\n(2:19:52) &#8211; Life story and career advice\n(2:23:49) &#8211; Money and happiness\n(2:27:41) &#8211; Acquisition offers from OpenAI and Meta\n(2:44:51) &#8211; How OpenClaw works\n(2:56:09) &#8211; AI slop\n(3:02:13) &#8211; AI agents will replace 80% of apps\n(3:10:50) &#8211; Will AI replace programmers?\n(3:22:50) &#8211; Future of OpenClaw community",
      "link": "https://lexfridman.com/peter-steinberger/?utm_source=rss&utm_medium=rss&utm_campaign=peter-steinberger"
    }
  ],
  "papers": [
    {
      "title": "Boundary Point Jailbreaking of Black-Box LLMs",
      "authors": [
        "Xander Davies",
        "Giorgi Giglemiani",
        "Edmund Lau",
        "Eric Winsor",
        "Geoffrey Irving"
      ],
      "abstract": "Frontier LLMs are safeguarded against attempts to extract harmful information via adversarial prompts known as \"jailbreaks\". Recently, defenders have developed classifier-based systems that have survived thousands of hours of human red teaming. We introduce Boundary Point Jailbreaking (BPJ), a new class of automated jailbreak attacks that evade the strongest industry-deployed safeguards. Unlike previous attacks that rely on white/grey-box assumptions (such as classifier scores or gradients) or l",
      "link": "https://arxiv.org/pdf/2602.15001v1",
      "published": "2026-02-16",
      "arxiv_id": "2602.15001v1",
      "citation_count": null,
      "quick_summary": "Frontier <strong>LLMs</strong> are safeguarded against attempts to extract harmful information via adversarial prompts known as \"<strong>jailbreaks</strong>\". Recently, defenders have developed classifier-based systems that have survived thousands of hours of human red teaming.",
      "raw_text": "Frontier LLMs are safeguarded against attempts to extract harmful information via adversarial prompts known as \"jailbreaks\". Recently, defenders have developed classifier-based systems that have survived thousands of hours of human red teaming. We introduce Boundary Point Jailbreaking (BPJ), a new class of automated jailbreak attacks that evade the strongest industry-deployed safeguards. Unlike previous attacks that rely on white/grey-box assumptions (such as classifier scores or gradients) or l"
    },
    {
      "title": "Exposing the Systematic Vulnerability of Open-Weight Models to Prefill Attacks",
      "authors": [
        "Lukas Struppek",
        "Adam Gleave",
        "Kellin Pelrine"
      ],
      "abstract": "As the capabilities of large language models continue to advance, so does their potential for misuse. While closed-source models typically rely on external defenses, open-weight models must primarily depend on internal safeguards to mitigate harmful behavior. Prior red-teaming research has largely focused on input-based jailbreaking and parameter-level manipulations. However, open-weight models also natively support prefilling, which allows an attacker to predefine initial response tokens before",
      "link": "https://huggingface.co/papers/2602.14689",
      "published": "2026-02-16",
      "arxiv_id": "",
      "citation_count": null,
      "quick_summary": "As the capabilities of large language models continue to advance, so does their potential for misuse. While closed-source models typically rely on external defenses, open-weight models must primarily depend on internal safeguards to mitigate harmful behavior.",
      "raw_text": "As the capabilities of large language models continue to advance, so does their potential for misuse. While closed-source models typically rely on external defenses, open-weight models must primarily depend on internal safeguards to mitigate harmful behavior. Prior red-teaming research has largely focused on input-based jailbreaking and parameter-level manipulations. However, open-weight models also natively support prefilling, which allows an attacker to predefine initial response tokens before"
    },
    {
      "title": "Nanbeige4.1-3B: A Small General Model that Reasons, Aligns, and Acts",
      "authors": [
        "Chen Yang",
        "Guangyue Peng",
        "Jiaying Zhu",
        "Ran Le",
        "Ruixiang Feng"
      ],
      "abstract": "We present Nanbeige4.1-3B, a unified generalist language model that simultaneously achieves strong agentic behavior, code generation, and general reasoning with only 3B parameters. To the best of our knowledge, it is the first open-source small language model (SLM) to achieve such versatility in a single model. To improve reasoning and preference alignment, we combine point-wise and pair-wise reward modeling, ensuring high-quality, human-aligned responses. For code generation, we design complexi",
      "link": "https://huggingface.co/papers/2602.13367",
      "published": "2026-02-13",
      "arxiv_id": "",
      "citation_count": null,
      "quick_summary": "We present Nanbeige4. 1-3B, a unified generalist language model that simultaneously achieves strong agentic behavior, code generation, and general reasoning with only 3B parameters.",
      "raw_text": "We present Nanbeige4.1-3B, a unified generalist language model that simultaneously achieves strong agentic behavior, code generation, and general reasoning with only 3B parameters. To the best of our knowledge, it is the first open-source small language model (SLM) to achieve such versatility in a single model. To improve reasoning and preference alignment, we combine point-wise and pair-wise reward modeling, ensuring high-quality, human-aligned responses. For code generation, we design complexi"
    },
    {
      "title": "Benchmarking Knowledge-Extraction Attack and Defense on Retrieval-Augmented Generation",
      "authors": [
        "Zhisheng Qi",
        "Utkarsh Sahu",
        "Li Ma",
        "Haoyu Han",
        "Ryan Rossi"
      ],
      "abstract": "Retrieval-Augmented Generation (RAG) has become a cornerstone of knowledge-intensive applications, including enterprise chatbots, healthcare assistants, and agentic memory management. However, recent studies show that knowledge-extraction attacks can recover sensitive knowledge-base content through maliciously crafted queries, raising serious concerns about intellectual property theft and privacy leakage. While prior work has explored individual attack and defense techniques, the research landsc",
      "link": "https://huggingface.co/papers/2602.09319",
      "published": "2026-02-10",
      "arxiv_id": "",
      "citation_count": null,
      "quick_summary": "<strong>Retrieval</strong>-<strong>Augmented</strong> <strong>Generation</strong> (RAG) has become a cornerstone of knowledge-intensive applications, including enterprise chatbots, healthcare assistants, and agentic memory management. However, recent studies show that knowledge-extraction attacks can recover sensitive knowledge-base content through maliciously crafted queries, raising serious concerns about intellectual property theft and privacy leakage.",
      "raw_text": "Retrieval-Augmented Generation (RAG) has become a cornerstone of knowledge-intensive applications, including enterprise chatbots, healthcare assistants, and agentic memory management. However, recent studies show that knowledge-extraction attacks can recover sensitive knowledge-base content through maliciously crafted queries, raising serious concerns about intellectual property theft and privacy leakage. While prior work has explored individual attack and defense techniques, the research landsc"
    },
    {
      "title": "Conversational Image Segmentation: Grounding Abstract Concepts with Scalable Supervision",
      "authors": [
        "Aadarsh Sahoo",
        "Georgia Gkioxari"
      ],
      "abstract": "Conversational image segmentation grounds abstract, intent-driven concepts into pixel-accurate masks. Prior work on referring image grounding focuses on categorical and spatial queries (e.g., \"left-most apple\") and overlooks functional and physical reasoning (e.g., \"where can I safely store the knife?\"). We address this gap and introduce Conversational Image Segmentation (CIS) and ConverSeg, a benchmark spanning entities, spatial relations, intent, affordances, functions, safety, and physical re",
      "link": "https://huggingface.co/papers/2602.13195",
      "published": "2026-02-13",
      "arxiv_id": "",
      "citation_count": null,
      "quick_summary": "<strong>Conversational</strong> image segmentation grounds abstract, intent-driven concepts into pixel-accurate masks. Prior work on referring image grounding focuses on categorical and spatial queries (e.",
      "raw_text": "Conversational image segmentation grounds abstract, intent-driven concepts into pixel-accurate masks. Prior work on referring image grounding focuses on categorical and spatial queries (e.g., \"left-most apple\") and overlooks functional and physical reasoning (e.g., \"where can I safely store the knife?\"). We address this gap and introduce Conversational Image Segmentation (CIS) and ConverSeg, a benchmark spanning entities, spatial relations, intent, affordances, functions, safety, and physical re"
    }
  ]
}