{
  "date": "Monday, February 23, 2026",
  "weather": {
    "current_temp": 35,
    "unit": "F",
    "conditions": "Heavy Snow And Areas Of Blowing Snow",
    "high": 35,
    "low": 32,
    "forecast": "Snow and areas of blowing snow. Cloudy. Low around 32, with temperatures rising to around 35 overnight. Wind chill values as low as 21. North wind around 35 mph, with gusts as high as 48 mph. Chance of precipitation is 100%. New snow accumulation of 6 to 10 inches possible.",
    "hourly": [
      {
        "label": "7am",
        "hour": 7,
        "temp": 34,
        "conditions": "Heavy Snow And Areas Of Blowing Snow",
        "wind": "33 mph N",
        "humidity": "75%",
        "precip_chance": "96%"
      },
      {
        "label": "9am",
        "hour": 9,
        "temp": 32,
        "conditions": "Heavy Snow And Areas Of Blowing Snow",
        "wind": "31 mph N",
        "humidity": "81%",
        "precip_chance": "96%"
      },
      {
        "label": "3pm",
        "hour": 15,
        "temp": 34,
        "conditions": "Light Snow Likely And Areas Of Blowing Snow",
        "wind": "24 mph NW",
        "humidity": "75%",
        "precip_chance": "56%"
      },
      {
        "label": "5pm",
        "hour": 17,
        "temp": 35,
        "conditions": "Slight Chance Light Snow",
        "wind": "23 mph NW",
        "humidity": "66%",
        "precip_chance": "22%"
      },
      {
        "label": "7pm",
        "hour": 19,
        "temp": 35,
        "conditions": "Cloudy",
        "wind": "24 mph NW",
        "humidity": "61%",
        "precip_chance": "13%"
      }
    ]
  },
  "news": [
    {
      "title": "Violence erupts in Mexico after killing of country's most wanted drug lord El Mencho",
      "source": "BBC News",
      "link": "https://www.bbc.com/news/articles/c795qgejzpxo?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 23 Feb 2026 11:27:45 GMT",
      "raw_text": "Cartel henchmen unleash violence after top drug lord killed in Mexico\nMembers of the Jalisco New Generation Cartel (CJNG), one of the most powerful and feared criminal organisations in Mexico, have unleashed a wave of violence across 20 Mexican states.\nThey torched businesses and erected burning blockades in retaliation to the killing of their leader, Nemesio Oseguera Cervantes, better known as \"El Mencho\", who died in custody on Sunday shortly after being captured by Mexican special forces.\nEl Mencho, Mexico's most wanted man, was seriously injured in a firefight between his bodyguards and the military commandos deployed to capture him.\nHe died while the military was transporting him from the town of Tapalpa, in Jalisco state, to the capital, Mexico City.\nAt least six of El Mencho's security guards were also killed in the operation, while three members of the Mexican military were injured, the defence ministry said.\nAs news of El Mencho's death spread, members of his cartel launched attacks in many towns and cities where the CJGN is active.\nIn some towns, they blocked roads by throwing spikes and nails onto the tarmac - in others, they commandeered buses and other vehicles they then torched in the middle of the road.\nCartel members also set alight dozens of banks and local businesses such as pharmacies.\nFootage recorded by locals showed plumes of smoke rising above several towns and cities, including the beach resort of Puerto Vallarta, which is popular with tourists.\nIn Guadalajara - one of the host cities of the forthcoming Fifa World Cup - travellers at the airport could be seen running and crouching on the floor in panic.\nNews site Milenio reported that the panic spread when a group came running into the airport to seek shelter after they had heard gunshots ring out from the nearby highway.\nTheir reporter said that he had seen a burnt-out car on the highway but that rumours that shots had been fired inside the terminal had been dismissed by the authorities.\nIn many towns, streets were deserted as local authorities told residents to seek shelter in their homes.\nThe scenes that unfolded on Sunday reminded many of the violence that erupted in the state of Sinaloa after the capture of another notorious drug lord - Ovidio Guzmán López - in 2019.\nThe street battles between members of his Sinaloa cartel and the security forces were so fierce that the Mexican authorities decided to free Guzmán López, who is the son of jailed drug kingpin Joaquín \"El Chapo\" Guzmán, to prevent further bloodshed.\nWhile Guzmán López was re-arrested in 2023 and extradited to the US, where he has pleaded guilty to drug-trafficking charges, retaliatory attacks by cartels have since become the norm following high-profile arrests.\nIn Puerto Vallarta, on Mexico's Pacific coast, tourists were told to shelter in place on Sunday.\nVideos showed black smoke billowing from burning cars in several neighbourhoods, with one tourist describing the scene as looking \"like a war zone\".\nAround 300 visitors were stuck at the Puerto Vallarta's airport after flights were cancelled due to the violence.\nTo ensure their safety, they were transferred to the city centre in a convoy with a heavy police escort.\nThe UK Foreign Office asked visitors to the town to \"exercise extreme caution\" and follow local authorities' advice, including orders to stay indoors.\nSara Morales, who is on holiday in Puerto Vallarta with her children, said that they had been asked to leave Las Glorias beach.\n\"I was very afraid because I didn't know what was happening,\" she told Mexican newspaper El Economista.\nThe US state department has urged its nationals to shelter in place until further notice in the states of Jalisco, Baja California, Quintana Roo and areas of Guanajuato, Guerrero, Michoacán, Oaxaca, Nuevo León and Tamaulipas.\nThe governor of Jalisco, where Puerto Vallarta is located, declared a \"code red\", halting all public transport and cancelling mass events and in-person classes.\nEl Universal newspaper said that more than 250 incidents of roads being blocked had been reported across the affected Mexican states.\nSecurity officials say that 90% of the blockades have been lifted but tension remains high, especially in the CJGN's stronghold of Jalisco.\nThey added that 25 people had been arrested, 11 for their alleged participation in violent acts and 14 more for alleged looting and pillaging.\nMexican President Claudia Sheinbaum urged people to stay \"calm and informed\". She added that \"in most parts of the country, activities are proceeding normally\".\nShe praised Mexico's security forces for the operation in which \"El Mencho\" was captured.\nThe Mexican president has come under pressure from the Trump administration to do more to combat the powerful transnational drug trafficking groups which are based in her country.\nUS Press Secretary Karoline Leavitt said late on Sunday night that El Mencho was a \"top target for the Mexican and United States government as one of the top traffickers of fentanyl into our homeland\".\nThe Mexican Ministry of Defence said that the raid aimed at capturing El Mencho had been carried out by the Mexican army, with support from the country's National Guard and Air Force.\nIt added that \"complementary information\" provided by the US had helped seize the drug lord.\nThe US State Department had offered a $15m (£11.1m) reward for information leading to his capture.\nMike Vigil, former chief of international operations for the US Drug Enforcement Administration, described the operation as \"one of the most significant actions undertaken in the history of drug trafficking\" to CBS, the BBC's US news partner.\nHave you been impacted by the violence in Mexico? Click here or use the form below.",
      "summary": "<strong>Mencho</strong>, <strong>Mexico</strong>'s most wanted man, was seriously injured in a firefight between his bodyguards and the military commandos deployed to capture him. He died while the military was transporting him from the town of Tapalpa, in Jalisco state, to the capital, <strong>Mexico</strong> City. At least six of El <strong>Mencho</strong>'s security guards were also killed in the operation, while three members of the Mexican military were injured, the defence ministry said."
    },
    {
      "title": "Stock futures fall amid uncertainty about Trump new tariffs: Live updates",
      "source": "CNBC",
      "link": "https://news.google.com/rss/articles/CBMid0FVX3lxTE1SYWhnTDBmNVdEWXc1eGRGbWw4a3B3RGJDVTM0Und0Qm55R2VockhlcFpNaVAybGVSRzRVZFp4cGFyRVYxMmZCQlZ5M3EteF9Jb2ZpQjNwX1gzOWJOQk1sX0x6SE01cmUxS3BqVUVta2VxNFJkdTNB0gF8QVVfeXFMTnotN0RrZ0szeTdEdUpwUklxdG5RdHE4Z1pEWVNRdEw4V21pQmhnYXFFZ1NtN1JRWnBrcWowLUlvV1Q5YXk1dFNIdnY4TEp6YzcwcFNDd1gxZmREWUI1b1g0X2FpaWRQR3NXMVN0NGxIbHR3ZGRzNGtjQ1lnaQ?oc=5",
      "published": "Mon, 23 Feb 2026 11:02:00 GMT",
      "raw_text": "U.S. stock futures fell on Monday after President Donald Trump said he's raising his global tariffs to 15% from 10% after the Supreme Court struck down the president's \"reciprocal\" tariffs. The new tariffs heightened market uncertainty about the outlook for inflation and global growth.\nDow Jones Industrial Average futures dropped 126 points, or 0.3%. S&P 500 futures and Nasdaq-100 futures slid 0.3% and 0.4%, respectively.\nOil prices sank, with Brent crude futures declining 0.5% to $71.37 a barrel. U.S. crude futures were at $66.11 a barrel, down 0.6%.\nBitcoin also slumped, tumbling at one point to below $65,000, before recovering to $66,317. It remains down 1.6% as the cryptocurrency's sharp sell-off continues.\nThose moves come after Trump on Saturday said he would increase global tariffs to 15%, up from the 10% he announced on Friday. Trump said the duties would go into effect immediately, though it was unclear whether any official documents had been signed regarding the timing.\n\"I, as President of the United States of America, will be, effective immediately, raising the 10% Worldwide Tariff on Countries, many of which have been 'ripping' the U.S. off for decades, without retribution (until I came along!), to the fully allowed, and legally tested, 15% level,\" Trump wrote.\nTrump also warned that additional levies would be coming over the next few months.\nWall Street is coming off a choppy trading session. On Friday, stocks initially rallied after the Supreme Court struck down a broad swath of Trump's trade agenda, before pulling back and then ultimately recovering again.\nThe Dow Jones Industrial Average ended the session higher by more than 230 points, 0.5%, recovering from a 200-point loss earlier in the session. The S&P 500 gained 0.7%, while the Nasdaq Composite rose 0.9%.\nInvestors hoped the Supreme Court ruling would soothe tensions between the U.S. and its trading partners and lead to possible refunds to companies affected by the tariffs, but are awaiting more clarity from the White House.\n\"It would seem that Wall Street — and Main Street — are going to be dealing with the issue of trade and tariffs for some time to come,\" Tim Holland, chief investment officer of Orion Wealth Management, wrote on Friday.\nMeanwhile, Iran remains a focal point for investors. This past week, Trump encouraged Iran to reach a deal over its nuclear program, warning that otherwise \"bad things\" might happen.\nTrump is scheduled to deliver his State of the Union address to Congress on Tuesday.\nNvidia earnings will be a key focus this week. The chipmaking giant is set to release results on Wednesday. It's one of only two Magnificent Seven stocks to have eked out a gain this year. The company will have to reassure investors that its artificial intelligence investment strategy remains intact.\nOn the economic front, durable goods orders and factory orders data are set to be released on Monday morning.",
      "summary": "l. U. S."
    },
    {
      "title": "'Confront failure and fix it': Families speak ahead of Nottingham attacks inquiry",
      "source": "BBC News",
      "link": "https://www.bbc.com/news/articles/c4g4dgxl9n5o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 23 Feb 2026 10:45:09 GMT",
      "raw_text": "Attacks inquiry a chance 'to confront failure'\nThe public inquiry into the Nottingham attacks will be a \"test of whether this country is prepared to confront failure and fix it\", the victims' families have said.\nThe judge-led inquiry is due to examine events leading up to the killing of Ian Coates, 65, and 19-year-old students Barnaby Webber and Grace O'Malley-Kumar by Valdo Calonane in June 2023.\nEvidence will be heard relating to the actions of agencies that had previously dealt with Calocane, who had been diagnosed with paranoid schizophrenia.\nBarnaby's mother Emma Webber has called for \"accountability right down to an individual level\" at the statutory public inquiry in London, which is due to run until May.\nCalocane is serving a hospital order after pleading guilty to three counts of manslaughter on the grounds of diminished responsibility, and three counts of attempted murder.\nThe families affected have always been unhappy with that outcome.\nAhead of the first day of hearings, Emma Webber read a statement on behalf of the victims' families outside the inquiry venue in London.\nShe said: \"Today is not simply the start of an inquiry, it is a test of whether this country is prepared to confront failure and fix it.\n\"For years we have heard apologies. We have seen reviews, we have read reports, but apologies do not keep the public safe - change does.\n\"We are not here for sympathy, we are here for safeguards, not reflection, not regret. Reform.\n\"That is the legacy Barnaby, Grace and Ian deserve, and that is what public safety now demands.\"\nEarlier she told BBC Radio 4's Today programme she anticipated the next nine weeks would be \"brutal\".\n\"It's been everything we've fought for nearly three years,\" she said. \"Now that it's here it does feel overwhelming, but it does feel like the time is now.\n\"So much went so wrong across every single institution, but in simple words we need the proper truth to come out now.\n\"We need proper accountability right down to an individual level for those who failed and haven't done their job properly.\"\n\"We have to insist that there are changes in practice in every single institution and organisation, and that will add up to sweeping changes that will benefit everyone.\"\nFamilies 'climbed mountains'\nCalocane had previously been under the care of Nottinghamshire Healthcare NHS Foundation Trust and had been known to police before he carried out the attacks.\nSince his sentencing, a series of reviews of criticisms have emerged, highlighting serious failings into into his care.\nPrime Minister Sir Keir Starmer eventually agreed to the inquiry last year, after lobbying from the survivors and bereaved families.\nThe Nottingham Inquiry is being chaired by retired judge Her Honour Deborah Taylor and is expected to hear evidence until the end of May.\nTaylor said of the bereaved families and survivors: \"In getting to this point, they've climbed mountains only to find that they reached false summit after false summit.\"\nThe inquiry will examine what \"was, could, or should've been done\".\nWhile a number of reviews and investigations have taken place into individual organisation, the inquiry will examine the events leading up to the attacks as a whole.\nAnd despite those earlier reviews, the victims' families previously said a statutory inquiry - which meant witnesses were compelled to give evidence - was the level of accountability they wanted.\nOnce all evidence has been heard, the chair will have two years to set out a final report and make recommendations.\nFollow BBC Nottingham on Facebook, on X, or on Instagram. Send your story ideas to eastmidsnews@bbc.co.uk or via WhatsApp on 0808 100 2210.",
      "summary": "who had been diagnosed with paranoid schizophrenia. Barnaby's mother Emma Webber has called for \"<strong>accountability right down to an individual level</strong>\" at the statutory public inquiry in London, which is due to run until May. Calocane is serving a hospital order after pleading guilty to three counts of manslaughter on the grounds of diminished responsibility, and three counts of attempted murder."
    },
    {
      "title": "Netflix boss defends bid for Warner Bros as Paramount deadline looms",
      "source": "BBC News",
      "link": "https://www.bbc.com/news/articles/c20jn073gj4o?at_medium=RSS&at_campaign=rss",
      "published": "Mon, 23 Feb 2026 10:41:49 GMT",
      "raw_text": "Netflix boss defends bid for Warner Bros as Paramount deadline looms\nThe boss of Netflix has told the BBC its takeover bid for Warner Bros is better than a rival one from Paramount because it would expand the business and the industry.\nNetflix co-chief executive Ted Sarandos told the Today programme its bid was focused on \"growth\", adding: \"We're buying a movie studio and a distribution entity that we don't currently have - we'll be adding to the market.\"\nLast December, Warner Bros agreed to a takeover offer from Netflix for some of its assets, but Paramount has made a rival offer.\nLast week, Warner Bros gave Paramount until the end of Monday to submit a \"best and final\" offer ahead of the shareholder vote on the Netflix deal next month.\nNetflix has offered $27.75 a share, or $82.7bn (£61.2bn) in total, for Warner Bros' studio and streaming networks - including brands such as Warner Bros, New Line Cinema, and HBO Max - leaving the rest of the firm to be spun off as an independent company.\nHowever, Paramount's $30 a share, or $108.4bn, bid is for the entire company, including the firm's traditional pay-TV networks, which are seen as a declining business.\nSarandos said Paramount was \"continuing to try to disrupt\" Netflix's deal with Warner Bros.\nHe said Netflix's bid was better than Paramount's as it would be \"buying assets we don't currently have\".\n\"This industry would be much smaller under that [Paramount] ownership than it would be under Netflix,\" he added.\n\"Our deal is growth. We've been growing and growing and growing this business since we started,\" he said.\nHe used Netflix's investment in the UK as an example of its growth strategy, saying it had created 50,000 jobs and spent \"$6bn in the UK on original programming\" since 2020.\nSarandos said Paramount \"has committed that they're going to cut $6bn out of the business right away\", and then would \"need to cut an additional $16bn\".\n\"There's five major studios left in Hollywood. If the Paramount deal were to go through, it would be four, because basically they're taking two studios and collapsing them in to one,\" he said.\nThe BBC has contacted Paramount for comment.\nParamount has previously said its deal gives shareholders more certainty than Netflix's plan. It has also offered to pay the $2.8bn break-up fee Warner Bros has agreed to pay Netflix if that deal falls through.\nLast week, Paramount said it would \"continue to advance our tender offer\" and maintain its \"opposition to the inferior Netflix merger\".\nIn his interview with the BBC, Sarandos batted away threats from President Trump who said that if Netflix did not fire Democratic board member Susan Rice, the streaming giant would \"face the consequences\".\nSarandos said: \"This is a business deal, it's not a political deal.\n\"He [Trump] likes to do a lot of things on social media,\" he added.",
      "summary": "akeover offer from <strong>Netflix</strong> for some of its assets, but <strong>Paramount</strong> has made a rival offer. Last week, <strong>Warner</strong> <strong>Bros</strong> gave <strong>Paramount</strong> until the end of Monday to submit a \"<strong>best and final</strong>\" offer ahead of the shareholder vote on the <strong>Netflix</strong> deal next month. <strong>Netflix</strong> has offered <strong>$27.</strong>"
    },
    {
      "title": "U.S. has a quarter fewer immigration judges than it did a year ago. Here's why",
      "source": "NPR",
      "link": "https://www.npr.org/2026/02/23/g-s1-110911/trump-immigration-judges-dismissals-numbers",
      "published": "Mon, 23 Feb 2026 05:30:00 -0500",
      "raw_text": "U.S. has a quarter fewer immigration judges than it did a year ago. Here's why\nAmiena Khan was supposed to have the day off that December. But, in a supervisory role at an immigration court, \"you never really are on leave,\" she said. So Khan was working — mostly on performance evaluations for the 36 immigration judges and dozens of staff members she oversaw at the court in Manhattan's 26 Federal Plaza.\nAt 11:29 a.m., while in the middle of a meeting, Khan received the email she had been dreading for months: she had been fired. As her phone began blowing up, she learned that six of the judges she supervised had been terminated as well.\n\"As I tried to reassure them, I was trying to explain, 'But I've been terminated too,'\" said Khan, who had been an assistant chief immigration judge at the court. \"It was chilling and — in how the terminations were effectuated — it was disrespectful. It was utter disregard of dedicated public servants.\"\nWhile Khan's firing was upsetting, she said it wasn't altogether shocking. The Trump administration fired nearly 100 judges in 2025. The dismissals were part of a larger push by the Trump administration to reshape America's immigration courts.\nThe number of judges in the nation's immigration courts shrunk by about a quarter in the last year due to firings and resignations — even when accounting for new hires. Twelve immigration courts have lost over half of their judges. Many courts are down to skeleton crews to handle thousands of cases; two courts have no judges at all.\nIn total, the Department of Justice's Executive Office for Immigration Review, or EOIR, lost over 400 legal assistants, attorney advisers and legal administrative specialists, according to data obtained and verified by NPR.\nThe continued drain of personnel and resources from the already strained immigration court system has contributed to depleted staff morale, mounting case backlogs — and a floundering due process system.\nSome former judges call this a shrinkage of America's immigration courts that sends a clear message from the Trump administration: to green-light mass deportations, and get rid of the judges they think stand in the way.\n\"You are telling every other judge that is left that they better not be following the law or their conscience; that they need to apply the law as you are interpreting it,\" said Arwen Swink, a former immigration judge fired from a San Francisco court in December. \"You lose a little piece of justice. You lose some fundamental fairness, and understandably, you undermine confidence in the proceedings.\"\nThe Trump administration has defended its personnel decisions, saying judges under the Biden administration were too lenient with granting asylum or other statuses to those seeking to stay in the U.S.\n\"After four years of the Biden Administration forcing Immigration Courts to implement a de facto amnesty for hundreds of thousands of aliens, this Department of Justice is restoring integrity to our immigration system by following the law, timely completing cases, and hiring the most talented legal professionals to join in our mission to protect national security and public safety,\" a DOJ spokesperson said in a statement to NPR in response to questions about the loss of personnel.\nLoading...\nCuts nationwide, with some courts hit worse than others\nOn Feb. 4, 2025 — the day before the first immigration judge firing under President Trump's second term — the corps of permanent immigration judges consisted of 726 people: 683 immigration judges and 43 assistant chief immigration judges. They were spread across 75 courts nationwide.\nAs of Monday, there are 520 permanent immigration judges and 33 assistant chief immigration judges, even after accounting for recent new hires.\nOver the next several months, the Trump administration fired nearly 100 of these judges, according to an independent tally kept by NPR. Dozens more judges retired or resigned, citing discomfort surrounding new policies about how they were supposed to adjudicate, according to interviews with current and former EOIR staff.\n\"I really wanted to retire from this job much, much later than I did,\" said Ana Partida, a judge who retired from the Otay Mesa court in San Diego in October. \"I no longer felt that I had judicial independence to conduct my courtroom and to make decisions under the law as I interpreted it.\"\nIn total, 202 judges who were working in early 2025 are no longer there. Attrition has trickled down. About 75% of the attorney advisers have left EOIR. Fifty-four percent of court supervisors are also gone – which means that those who remain are managing multiple courts at once.\nLoading...\nFive courts have more judges assigned to them than they did at the start of 2025. Separately, the Baton Rouge Immigration Court in Louisiana, created during the Biden administration, officially opened last year, but was staffed with existing judges who were previously assigned to other locations.\nFirings \"sent waves all across the United States\"\nFor years, being an immigration judge was considered a stable job.\n\"When I was onboarded, there were all kinds of jokes in the agency that if you were a judge and you wanted to get fired, they'd have to catch you with a bloody axe,\" said Swink, the former San Francisco judge, who had been at the agency since December 2016. \"It was very, very, very rare for judges to be fired.\"\nThe Trump administration began 2025 by wiping the slate clean by letting go of leadership at the highest levels of EOIR. Then it moved to terminating judges who were still within their two-year probationary period, a trial period for federal workers before they are \"converted\" to permanent employees.\nThe first judge fired was Tania Nemer in the Cleveland Immigration Court. She was dismissed while in the middle of a hearing and escorted out of the building. (She has since sued over her termination, arguing it violated civil rights law and her First Amendment rights.)\n\"Being walked off a bench like you're a criminal is just very shocking,\" Nemer said. \"That shock sent waves all across the United States. Everyone heard that this judge from Cleveland got escorted out of the building.\"\nBut by the end of the year, the administration moved beyond probationary workers, with tenured judges and DOJ employees being cut.\nKhan, the courthouse supervisor at New York's 26 Federal Plaza immigration court, pushed back on the idea that dismissed judges weren't meeting work standards, as the administration has argued.\n\"The message and the mission of [EOIR] is to ensure fundamentally fair hearings and due process and efficiency. And that's what immigration judges strive to do,\" Khan said. \"As a supervisor of the dismissed judges, each and every one of them was meeting their obligations.\"\nEOIR has previously said that any staff reductions have not affected productivity. But the system still has a nearly 4 million case backlog.\nThose who stay face push to be \"deportation judges\"\nJudges and staff who are left in the immigration courts describe the past year as traumatizing and demoralizing. They say the current justice system is fundamentally different from one a year ago.\nOne visible change was to the work environment.\nFrom New York to Connecticut to San Francisco, people in otherwise bureaucratic roles like clerks, interpreters and judges were surrounded by the chaos of violent arrests by Immigration and Customs officers in the hallways of courtrooms and witnessed these agents clash with protestors outside, several told NPR.\n\"There were a couple of times where we could hear respondents screaming when they were getting arrested. You have to pretend you're not hearing or seeing anything,\" said a court clerk at an immigration court who spoke on the condition of anonymity out of fear of reprisals for their position. \"Because you're not really supposed to show emotion in court, you're supposed to be neutral.\"\nJudges also feel pressure to decide cases in line with the administration's priorities.\nA public hiring campaign to beef up the immigration court system with \"deportation judges\" is in full swing, as the Trump administration seeks to make up for the judges who were fired or left.\n\"Deliver justice to criminal illegal aliens. Become a deportation judge. Save your country,\" the social media ads read.\nOlivia Cassin saw an advertisement for deportation judges posted online by the Department of Homeland Security on Nov. 21, 2025 — the same day that she was fired from the immigration court at 290 Broadway Court in New York.\n\"We were like, that's a hoax, that can't be,\" Cassin said. \"And then we looked at the website for the Department of Justice, and there was the same. It's a clear message that what you're there to do – is not to carefully examine each case for people due process. The main point seems to be expedited deportation and resolution of cases.\"\nSince launching the campaign in November, DOJ has hired 17 permanent judges, most who come from ICE and other DHS backgrounds, and 52 temporary judges. The temporary judges are military lawyers approved for temporary assignments by the Pentagon.\nNew judges who don't comply with the administration's priorities may already be facing consequences. One JAG judge, Christopher Day, a U.S. Army Reserve lawyer, had granted asylum and relief from immediate deportation at a higher rate than his other JAG counterparts, according to EOIR data compiled by Mobile Pathways.\nDay has been removed from his post, per EOIR's website.\nCourts squeezed, one will shutter as judges are fired\nWhile the majority of courts across the country have lost judges, the impacts have not been spread evenly. Of the 17 new permanent judges onboarded by the Trump administration, only one has been assigned to work in a court that has lost the majority of its judges.\nEOIR declined to specify how it allocates new judges, but noted that any immigration judge can hear any case at any time throughout the country to assist with caseloads.\nLoading...\nIt's been an especially tumultuous year for the San Francisco Immigration Court. The court was a visible point of conflict in 2025, as immigrant justice groups frequently rallied outside it to protest ICE arrests.\nAt the start of 2025, the judges in San Francisco were pushed to hear four cases per day — double their typical workload — and were told to grant asylum more sparingly, according to multiple interviews with current and former judges. Then, the firings and resignations began.\nIn 2025, the court lost 16 judges — the most of any court in the country. NPR confirmed that at least 12 of these people were fired.\nEOIR announced that the court would be closing its doors at 100 Montgomery St. at the end of the year. The caseload at San Francisco, which is currently sitting at around 120,000 immigration cases, will be transferred to the Concord Immigration Court in a neighboring city, which has 60,000 cases of its own, according to December Transactional Records Access Clearinghouse data.\n\"If you're trying to promote access to justice, having the San Francisco court open is a big boon,\" Swink said. \"But if the goals are the opposite, then a court like San Francisco would be first on the chopping block.\"\nEOIR spokesperson Kathryn Mattingly told NPR the move to Concord \"would be more cost-effective.\"\n\"Tremendous weight\" on smaller courts\nWhile losses have been spread across the country, some of the biggest impacts have been felt inside smaller courts, fourteen of which are now operating with two or fewer permanent judges.\n\"Even with a fully staffed court and wonderful people in your court, it is a very difficult job to do because you take so much of that secondary trauma home,\" said Partida, who retired from the Otay Mesa court in San Diego. Her two former colleagues now must oversee more than 1,000 active cases in total.\nAs the number of detentions surge and judge caseloads increase, \"the stress of having no resources and no help, even as to other judges hearing cases, that is a tremendous weight,\" she added.\nThe Aurora Immigration Court in Colorado and the Oakdale Immigration Court in Louisiana, which started 2025 with two and three judges respectively, now have zero permanent judges. They both still have an ACIJ, or court supervisor, who may be handling dockets, although both of those people are also responsible for supervising other courts.\nAt the beginning of 2025, the Saipan Immigration Court in the Northern Mariana Islands, a U.S. territory, was the only court operating with one judge. Now, five courts – whose case loads range from several hundred to over 40,000 – have just one permanent judge.\nFormer immigration judge Ted Doolittle said the workload at the Hartford Immigration Court in Connecticut was overwhelming, topping 40,000 at the start of 2025, when there were five judges on the bench.\n\"I felt like they're asking me to be a judge and make these legal decisions, and meanwhile, I'm flying a small plane,\" Doolittle said.\nDoolittle was terminated in September 2025. Three of his colleagues retired or took a \"fork in the road\" offer to leave their positions and retire early. The court is now down to one permanent judge.\n\"Those cases essentially are not being heard in any meaningful volume,\" he said. \"One guy can only do so much.\"\n—With assistance from NPR's Rahul Mukherjee.",
      "summary": "for months: she had been fired. As her phone began blowing up, she learned that six of the judges she supervised had been terminated as well. \"<strong>As I tried to reassure them, I was trying to explain, 'But I've been terminated too,'</strong>\" said Khan, who had been an assistant chief immigration judge at the court."
    }
  ],
  "podcasts": [
    {
      "podcast": "AI Daily Brief",
      "title": "Why AI Could Be Better for Plumbers than Programmers",
      "published": "2026-02-22",
      "summary": "AI is reshaping the economy—but not always in the way most leaders expect. This episode explores why AI could matter more for plumbers than programmers, shifting leverage to trade entrepreneurs by removing operational friction rather than replacing skilled labor. From Gen Z’s growing pivot toward the trades to the rise of agentic tools that unlock scale without headcount, the real opportunity isn’",
      "raw_text": "AI is reshaping the economy—but not always in the way most leaders expect. This episode explores why AI could matter more for plumbers than programmers, shifting leverage to trade entrepreneurs by removing operational friction rather than replacing skilled labor. From Gen Z’s growing pivot toward the trades to the rise of agentic tools that unlock scale without headcount, the real opportunity isn’t cost cutting—it’s empowering small operators to run dramatically better businesses.Want to build with OpenClaw?LEARN MORE ABOUT CLAW CAMP: ⁠⁠⁠⁠⁠https://campclaw.ai/⁠⁠⁠⁠⁠Or for enterprises, check out: ⁠⁠⁠⁠⁠https://enterpriseclaw.ai/⁠⁠⁠⁠⁠Brought to you by:KPMG – Agentic AI is powering a potential $3 trillion productivity shift, and KPMG’s new paper, Agentic AI Untangled, gives leaders a clear framework to decide whether to build, buy, or borrow—download it at ⁠www.kpmg.us/Navigate⁠Mercury - Modern banking for business and now personal accounts. Learn more at ⁠⁠⁠https://mercury.com/personal-banking⁠⁠⁠Rackspace Technology - Build, test and scale intelligent workloads faster with Rackspace AI Launchpad - ⁠⁠⁠⁠⁠⁠⁠⁠⁠http://rackspace.com/ailaunchpad⁠⁠⁠⁠⁠⁠⁠⁠⁠Blitzy - Want to accelerate enterprise software development velocity by 5x? ⁠⁠⁠⁠⁠⁠https://blitzy.com/⁠⁠⁠⁠⁠⁠Optimizely Agents in Action - Join the virtual event (with me!) free March 4 - ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://www.optimizely.com/insights/agents-in-action/⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠AssemblyAI - The best way to build Voice AI apps - ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://www.assemblyai.com/brief⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠LandfallIP - AI to Navigate the Patent Process - https://landfallip.com/Robots &amp; Pencils - Cloud-native AI solutions that power results ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://robotsandpencils.com/⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠The Agent Readiness Audit from Superintelligent - Go to ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://besuper.ai/ ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠to request your company's agent readiness score.The AI Daily Brief helps you understand the most important news and discussions in AI. Subscribe to the podcast version of The AI Daily Brief wherever you listen: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://pod.link/1680633614⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠Interested in sponsoring the show? sponsors@aidailybrief.ai",
      "link": "https://podcasters.spotify.com/pod/show/nlw/episodes/Why-AI-Could-Be-Better-for-Plumbers-than-Programmers-e3fef0d"
    },
    {
      "podcast": "This Week in Startups",
      "title": "We Asked 3 Experts How to Get More Value out of OpenClaw | E2253",
      "published": "2026-02-21",
      "summary": "Jordy Coltman claims <strong>new hardware is the optimal environment for AI agents</strong>, advocating for agents to be freed from screens and become proactive. Jesse Leimgruber demonstrated his <strong>OpenHome AI smart speakers</strong>, while Tremaine Grant showcased his \"virtual office\" interface and the \"Heartbeat Protocol.\"",
      "raw_text": "This Week In Startups is made possible by:Gusto - https://Gusto.com/twistCircle - https://circle.so/twistNorthwest Registered Agent - https://northwestregisteredagent.com/twistToday’s show:*Getting OpenClaw set up and running without destroying your bank account is one thing.But now that you have your agent or swarm operational, how can you use them to get real work done?We have three builders who are going to show you how to maximize your OpenClaw output!GUESTS:Jordy Coltman: Viral X author and creator of the WeeklyClaw newsletterJesse Leimgruber: Creator of the OpenHome.com smart speaker and kitTremaine Grant: Founder/CEO of PulsePLUS, on Off Duty, Lon and Jason talk “Knight of the 7 Kingdoms” and “The Pitt,” react to the “Mandalorian and Grogu” trailer, and check out some of Jason’s favorite headphones and earbuds.Timestamps:00:40 We’re gonna show you how to maximize your IRL OpenClaw productivity00:50 Even AI skeptic Lon is blown away by OpenClaw’s power01:46 Jordy Coltman’s top time-wasting mistakes made by OpenClaw beginners03:00 Why Jordy thinks new hardware is the best home for your agents05:38 Why Jason thinks “OpenClaw is a box” is coming soon08:29 Tremaine Grant of Pulse demos his “virtual office” interface and the “Heartbeat Protocol”00:10:15 Gusto - Gusto. Check out the online payroll and benefits experts with software built specifically for small business and startups. Try Gusto today and get three months FREE at Gusto.com/twist.00:15:16 What’s really happening when agents “chat” together?00:18:53 Jesse Leimgruber’s demos his OpenHome AI smart speakers00:19:47 Circle.so - The easiest way to build a home for your community, events, and courses — all under your own brand. TWiST listeners get $1,000 off the Circle Plus Plan by going to http://circle.so/twist.00:22:55 Freeing agents from screens and making them proactive00:29:43 Northwest Registered Agent - Northwest Registered Agent. Get more when you start your business with Northwest. In 10 clicks and 10 minutes, you can form your company and walk away with a real business identity — Learn more at www.northwestregisteredagent.com/twist00:30:58 Why Jason wants his agent to read Slack and emails to him00:50:05 Who polices autonomous agents? Other agents?00:53:32 Jason and Lon’s thoughts on “Knight of the Seven Kingdoms”00:56:20 Lon’s favorite picks from Quentin Tarantino’s Top 10 movies01:01:13 “The Mandalorian and Grogu” trailer reaction01:05:22 Jason’s favorite earbuds and headphonesSubscribe to the TWiST500 newsletter: https://ticker.thisweekinstartups.comCheck out the TWIST500: https://www.twist500.comSubscribe to This Week in Startups on Apple: https://rb.gy/v19fcpFollow Lon:X: https://x.com/lonsFollow Alex:X: https://x.com/alexLinkedIn: ⁠https://www.linkedin.com/in/alexwilhelmFollow Jason:X: https://twitter.com/JasonLinkedIn: https://www.linkedin.com/in/jasoncalacanisThank you to our partners:00:10:15 Gusto - Check out the online payroll and benefits experts with software built specifically for small business and startups. Try Gusto today and get three months FREE at Gusto.com/twist.00:19:47 Circle.so - The easiest way to build a home for your community, events, and courses — all under your own brand. TWiST listeners get $1,000 off the Circle Plus Plan by going to http://circle.so/twist.00:29:43 Northwest Registered Agent. Get more when you start your business with Northwest. In 10 clicks and 10 minutes, you can form your company and walk away with a real business identity — Learn more at www.northwestregisteredagent.com/twistCheck out all our partner offers: https://partners.launch.co/Great TWIST interviews: Will Guidara, Eoghan McCabe, Steve Huffman, Brian Chesky, Bob Moesta, Aaron Levie, Sophia Amoruso, Reid Hoffman, Frank Slootman, Billy McFarlandCheck out Jason’s suite of newsletters: https://substack.com/@calacanis",
      "link": "https://podcasters.spotify.com/pod/show/thisweekinstartups/episodes/We-Asked-3-Experts-How-to-Get-More-Value-out-of-OpenClaw--E2253-e3fcqp4"
    },
    {
      "podcast": "AI Daily Brief",
      "title": "Does Gemini 3.1 Pro Matter?",
      "published": "2026-02-20",
      "summary": "Gemini 3.1 Pro arrives with big benchmark gains and a sharp jump in reasoning, coding, and efficiency—but in a world where the frontier rotates weekly, raw performance isn’t the story. This episode looks at what actually matters: cost per task, multimodal dominance, and where Gemini fits in a model portfolio that now demands specialization over supremacy. In the headlines: India’s AI Impact Summit",
      "raw_text": "Gemini 3.1 Pro arrives with big benchmark gains and a sharp jump in reasoning, coding, and efficiency—but in a world where the frontier rotates weekly, raw performance isn’t the story. This episode looks at what actually matters: cost per task, multimodal dominance, and where Gemini fits in a model portfolio that now demands specialization over supremacy. In the headlines: India’s AI Impact Summit and the Altman-Amodei moment, Walmart bets on AI for growth, Amazon tracks employee AI usage, and Accenture ties promotions to adoption. Want to build with OpenClaw?LEARN MORE ABOUT CLAW CAMP: ⁠⁠⁠⁠https://campclaw.ai/⁠⁠⁠⁠Or for enterprises, check out: ⁠⁠⁠⁠https://enterpriseclaw.ai/⁠⁠⁠⁠Brought to you by:KPMG – Agentic AI is powering a potential $3 trillion productivity shift, and KPMG’s new paper, Agentic AI Untangled, gives leaders a clear framework to decide whether to build, buy, or borrow—download it at www.kpmg.us/NavigateMercury - Modern banking for business and now personal accounts. Learn more at ⁠⁠https://mercury.com/personal-banking⁠⁠Rackspace Technology - Build, test and scale intelligent workloads faster with Rackspace AI Launchpad - ⁠⁠⁠⁠⁠⁠⁠⁠http://rackspace.com/ailaunchpad⁠⁠⁠⁠⁠⁠⁠⁠Blitzy - Want to accelerate enterprise software development velocity by 5x? ⁠⁠⁠⁠⁠https://blitzy.com/⁠⁠⁠⁠⁠Optimizely Agents in Action - Join the virtual event (with me!) free March 4 - ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://www.optimizely.com/insights/agents-in-action/⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠AssemblyAI - The best way to build Voice AI apps - ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://www.assemblyai.com/brief⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠LandfallIP - AI to Navigate the Patent Process - https://landfallip.com/Robots &amp; Pencils - Cloud-native AI solutions that power results ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://robotsandpencils.com/⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠The Agent Readiness Audit from Superintelligent - Go to ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://besuper.ai/ ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠to request your company's agent readiness score.The AI Daily Brief helps you understand the most important news and discussions in AI. Subscribe to the podcast version of The AI Daily Brief wherever you listen: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://pod.link/1680633614⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠Interested in sponsoring the show? sponsors@aidailybrief.ai",
      "link": "https://podcasters.spotify.com/pod/show/nlw/episodes/Does-Gemini-3-1-Pro-Matter-e3fcld4"
    },
    {
      "podcast": "Morning Brew Daily",
      "title": "Tariffs Ineffective Against US Trade Deficit? & Family Feud Over Reese’s Recipe",
      "published": "2026-02-20",
      "summary": "Neal and Toby discussed that <strong>Trump's aggressive tariffs have not reduced the swelling trade deficit</strong>, while the <strong>grandson of the Reese's Peanut Butter Cup inventor publicly criticized Hershey's</strong> for using cheaper ingredients. Etsy sold its secondhand marketplace to eBay, leading investors to cheer and making it the <strong>Stock of the Week</strong>, and Amazon snapped a <strong>9-day losing streak</strong>, recovering from a <strong>$450 billion market value loss</strong>.",
      "raw_text": "Episode 784: Neal and Toby discuss the swelling trade deficit despite Trump’s aggressive tariffs. Then, the grandson of the Reese’s Peanut Butter Cup inventor is publicly criticizing Hershey’s for skimping out for cheaper ingredients. Also, Etsy sells its secondhand marketplace to eBay, which is a move investors are cheering for, making it the Stock of the Week. Meanwhile, Amazon finally snaps its 9-day losing streak that resulted in losing $450B in market value, making it the Dog of the Week. \n\nLearn more about FlavCity at https://go.shopflavcity.com/mbds \n\nSubscribe to Morning Brew Daily for more of the news you need to start your day. Share the show with a friend, and leave us a review on your favorite podcast app.\n\nListen to Morning Brew Daily Here:⁠ ⁠⁠https://www.swap.fm/l/mbd-note⁠⁠⁠ \n\nWatch Morning Brew Daily Here:⁠ ⁠⁠https://www.youtube.com/@MorningBrewDailyShow⁠\nLearn more about your ad choices. Visit megaphone.fm/adchoices",
      "link": ""
    },
    {
      "podcast": "This Week in Startups",
      "title": "When Will Openclaw go Mainstream? | E2252",
      "published": "2026-02-19",
      "summary": "Matthew believes Openclaw is <strong>not yet ready for consumer adoption</strong>, noting only <strong>10% of people are technical enough to install it</strong>. Ryan uses Openclaw in his personal life and predicts a <strong>new Openclaw fork is emerging</strong>, while Anthropic has <strong>patched the ability to use Openclaw through its Pro plan</strong>. Jason described his \"Clawpod\" workflow, and Matt used Openclaw to identify his stomach issues.",
      "raw_text": "This Week In Startups is made possible by:Gusto - Try Gusto today and get 3 months free at gust.com/twistCrusoe Cloud - Reserve your capacity for the latest GPU’s at crusoe.ai/savingsUber AI Solutions - Book a demo today at http://uber.com/ai-solutionsToday’s show: It’s a packed show! We’ve got YouTuber and Openclaw enthusiast Matthew Berman, Ryan Yaneli, founder of Nextvisit, and Jason Grad, founder of Massive! We’re all in on Openclaw, but we have no doubts there’s still room in the market for a GIANT Openclaw consumer app to shift the paradigm. What will that look like? Will it be an app? Will it be baked into the iPhone? Let’s explore!**Timestamps:* 00:00 Intro02:04 Why Matthew thinks Openclaw is not ready yet to be brought to the consumer04:45 Jason doesn’t want hundreds of different apps, and thousands of tabs05:45 Why Ryan sees open claw giving consumers access to opportunities they couldn’t have gotten to otherwise.07:02 Only 10% of people are technical enough to install openclaw08:16 Would Openclaw be better off as an app?08:27 Gusto. Check out the online payroll and benefits experts with software built specifically for small business and startups. Try Gusto today and get three months FREE at gusto.com/twist 10:52 The killer use case that could bring Openclaw to the consumer00:12:13 Why Meta acquired Manus.00:15:13 How Ryan uses Openclaw in his personal life00:18:44 Crusoe Cloud: Crusoe is the AI factory company. Reliable infrastructure and expert support. Visit crusoe.ai/savings to reserve your capacity for the latest GPUs today00:23:24 What Jason’s “Clawpod” does00:24:38 Jason demos his Openclaw workflow00:28:23 Uber AI Solutions - Your trusted partner to get AI to work in the real world. Book a demo with them TODAY at http://uber.com/twist00:30:04 How Matt used Openclaw to figure out he’s been having stomach issues00:32:27 What will be the ultimate UX for AI?00:38:53 Anthropic has patched the ability to use Openclaw through its pro plan!00:42:20 Matt and Jason hope for a multi-model future — but we haven’t made progress!00:52:21 Jason has skepticisms about the Openclaw foundation00:52:59 Ryan predicts a new Openclaw fork coming from the shadows!00:54:21 Peter Steinberger is going to OpenAI, NOT to work with Openclaw… Will he “orphan” openclaw00:58:19 does raspberry AI stand a chance against Apple?*Subscribe to the TWiST500 newsletter: https://ticker.thisweekinstartups.com/Check out the TWIST500: https://www.twist500.comSubscribe to This Week in Startups on Apple: https://rb.gy/v19fcp*Follow Lon:X: https://x.com/lons*Follow Alex:X: https://x.com/alexLinkedIn: ⁠https://www.linkedin.com/in/alexwilhelm*Follow Jason:X: https://twitter.com/JasonLinkedIn: https://www.linkedin.com/in/jasoncalacanis*Thank you to our partners:Gusto. Check out the online payroll and benefits experts with software built specifically for small business and startups. Try Gusto today and get three months FREE at gust.com/twist Crusoe Cloud*: Crusoe is the AI factory company. Reliable infrastructure and expert support. Visit [crusoe.ai/savings to reserve your capacity for the latest GPUs today.Uber AI Solutions -*Your trusted partner to get AI to work in the real world. Book a demo with them TODAY at Uber.com/twist",
      "link": "https://podcasters.spotify.com/pod/show/thisweekinstartups/episodes/When-Will-Openclaw-go-Mainstream---E2252-e3f9rua"
    }
  ],
  "papers": [
    {
      "title": "VIRAASAT: Traversing Novel Paths for Indian Cultural Reasoning",
      "authors": [
        "Harshul Raj Surana",
        "Arijit Maji",
        "Aryan Vats",
        "Akash Ghosh",
        "Sriparna Saha"
      ],
      "abstract": "Large Language Models (LLMs) have made significant progress in reasoning tasks across various domains such as mathematics and coding. However, their performance deteriorates in tasks requiring rich socio-cultural knowledge and diverse local contexts, particularly those involving Indian Culture. Existing Cultural benchmarks are (i) Manually crafted, (ii) contain single-hop questions testing factual recall, and (iii) prohibitively costly to scale, leaving this deficiency largely unmeasured. To add",
      "link": "https://arxiv.org/pdf/2602.18429v1",
      "published": "2026-02-20",
      "arxiv_id": "2602.18429v1",
      "citation_count": null,
      "quick_summary": "The VIRAASAT paper proposes a new benchmark to evaluate Large Language Models (LLMs) on Indian cultural reasoning. It reveals that LLMs' performance <strong>deteriorates significantly in tasks requiring rich socio-cultural knowledge</strong> and diverse local contexts specific to Indian Culture.",
      "raw_text": "Large Language Models (LLMs) have made significant progress in reasoning tasks across various domains such as mathematics and coding. However, their performance deteriorates in tasks requiring rich socio-cultural knowledge and diverse local contexts, particularly those involving Indian Culture. Existing Cultural benchmarks are (i) Manually crafted, (ii) contain single-hop questions testing factual recall, and (iii) prohibitively costly to scale, leaving this deficiency largely unmeasured. To add"
    },
    {
      "title": "SPQ: An Ensemble Technique for Large Language Model Compression",
      "authors": [
        "Jiamin Yao",
        "Eren Gultepe"
      ],
      "abstract": "This study presents an ensemble technique, SPQ (SVD-Pruning-Quantization), for large language model (LLM) compression that combines variance-retained singular value decomposition (SVD), activation-based pruning, and post-training linear quantization. Each component targets a different source of inefficiency: i) pruning removes redundant neurons in MLP layers, ii) SVD reduces attention projections into compact low-rank factors, iii) and 8-bit quantization uniformly compresses all linear layers. A",
      "link": "https://arxiv.org/pdf/2602.18420v1",
      "published": "2026-02-20",
      "arxiv_id": "2602.18420v1",
      "citation_count": null,
      "quick_summary": "SPQ (SVD-Pruning-Quantization) introduces an ensemble technique for Large Language Model (LLM) compression, combining variance-retained singular value decomposition (SVD), activation-based pruning, and post-training linear 8-bit quantization. This method <strong>reduces attention projections into compact low-rank factors</strong> and <strong>uniformly compresses all linear layers</strong>, enhancing efficiency.",
      "raw_text": "This study presents an ensemble technique, SPQ (SVD-Pruning-Quantization), for large language model (LLM) compression that combines variance-retained singular value decomposition (SVD), activation-based pruning, and post-training linear quantization. Each component targets a different source of inefficiency: i) pruning removes redundant neurons in MLP layers, ii) SVD reduces attention projections into compact low-rank factors, iii) and 8-bit quantization uniformly compresses all linear layers. A"
    },
    {
      "title": "AI-Wrapped: Participatory, Privacy-Preserving Measurement of Longitudinal LLM Use In-the-Wild",
      "authors": [
        "Cathy Mengying Fang",
        "Sheer Karny",
        "Chayapatr Archiwaranguprok",
        "Yasith Samaradivakara",
        "Pat Pataranutaporn"
      ],
      "abstract": "Alignment research on large language models (LLMs) increasingly depends on understanding how these systems are used in everyday contexts. yet naturalistic interaction data is difficult to access due to privacy constraints and platform control. We present AI-Wrapped, a prototype workflow for collecting naturalistic LLM usage data while providing participants with an immediate ``wrapped''-style report on their usage statistics, top topics, and safety-relevant behavioral patterns. We report finding",
      "link": "https://arxiv.org/pdf/2602.18415v1",
      "published": "2026-02-20",
      "arxiv_id": "2602.18415v1",
      "citation_count": null,
      "quick_summary": "AI-Wrapped presents a prototype workflow for participatory, privacy-preserving measurement of longitudinal LLM use in real-world settings. It enables the collection of naturalistic LLM usage data while providing participants with immediate \"wrapped\"-style reports on their <strong>usage statistics and safety-relevant behavioral patterns</strong>.",
      "raw_text": "Alignment research on large language models (LLMs) increasingly depends on understanding how these systems are used in everyday contexts. yet naturalistic interaction data is difficult to access due to privacy constraints and platform control. We present AI-Wrapped, a prototype workflow for collecting naturalistic LLM usage data while providing participants with an immediate ``wrapped''-style report on their usage statistics, top topics, and safety-relevant behavioral patterns. We report finding"
    },
    {
      "title": "\"How Do I ...?\": Procedural Questions Predominate Student-LLM Chatbot Conversations",
      "authors": [
        "Alexandra Neagu",
        "Marcus Messer",
        "Peter Johnson",
        "Rhodri Nelson"
      ],
      "abstract": "Providing scaffolding through educational chatbots built on Large Language Models (LLM) has potential risks and benefits that remain an open area of research. When students navigate impasses, they ask for help by formulating impasse-driven questions. Within interactions with LLM chatbots, such questions shape the user prompts and drive the pedagogical effectiveness of the chatbot's response. This paper focuses on such student questions from two datasets of distinct learning contexts: formative s",
      "link": "https://arxiv.org/pdf/2602.18372v1",
      "published": "2026-02-20",
      "arxiv_id": "2602.18372v1",
      "citation_count": null,
      "quick_summary": "The paper analyzes student questions in Large Language Model (LLM) chatbot conversations across two distinct learning contexts. It finds that \"<strong>procedural questions</strong>\" (e.g., \"How do I...?\") predominantly shape user prompts and <strong>drive the pedagogical effectiveness of chatbot responses</strong> when students encounter impasses.",
      "raw_text": "Providing scaffolding through educational chatbots built on Large Language Models (LLM) has potential risks and benefits that remain an open area of research. When students navigate impasses, they ask for help by formulating impasse-driven questions. Within interactions with LLM chatbots, such questions shape the user prompts and drive the pedagogical effectiveness of the chatbot's response. This paper focuses on such student questions from two datasets of distinct learning contexts: formative s"
    },
    {
      "title": "Frontier AI Risk Management Framework in Practice: A Risk Analysis Technical Report v1.5",
      "authors": [
        "Dongrui Liu",
        "Yi Yu",
        "Jie Zhang",
        "Guanxu Chen",
        "Qihao Lin"
      ],
      "abstract": "To understand and identify the unprecedented risks posed by rapidly advancing artificial intelligence (AI) models, Frontier AI Risk Management Framework in Practice presents a comprehensive assessment of their frontier risks. As Large Language Models (LLMs) general capabilities rapidly evolve and the proliferation of agentic AI, this version of the risk analysis technical report presents an updated and granular assessment of five critical dimensions: cyber offense, persuasion and manipulation, s",
      "link": "https://huggingface.co/papers/2602.14457",
      "published": "2026-02-16",
      "arxiv_id": "",
      "citation_count": null,
      "quick_summary": "Frontier AI Risk Management Framework in Practice presents a comprehensive assessment of unprecedented risks posed by rapidly advancing AI models, including LLMs and agentic AI. This technical report offers an updated and granular assessment across <strong>five critical dimensions</strong>, such as <strong>cyber offense and persuasion/manipulation</strong>.",
      "raw_text": "To understand and identify the unprecedented risks posed by rapidly advancing artificial intelligence (AI) models, Frontier AI Risk Management Framework in Practice presents a comprehensive assessment of their frontier risks. As Large Language Models (LLMs) general capabilities rapidly evolve and the proliferation of agentic AI, this version of the risk analysis technical report presents an updated and granular assessment of five critical dimensions: cyber offense, persuasion and manipulation, s"
    }
  ],
  "ai_security_news": [
    {
      "title": "Protecting AI Security: 2025 Hot Security Incident",
      "source": "Security Boulevard",
      "link": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQdnFQYnBkRjZQeU1Jai15Ni1sRy1zNDJ2Tjg3ZzRnTS00NlcxdURuNjlPZGVTdlYzc0tXcS1NcWJBZTBnbDVZMkpJbS0wdndiUXFKeGtsYVpxYUk2NlozaVBweEdTRXhQNGx4RW1ZSHRadU1tbFJtaVR3a3E0RDNqdmM3aVRaWVNzVmtlNGlObHRoZw?oc=5",
      "published": "Mon, 23 Feb 2026 11:15:00 GMT",
      "summary": "In May 2025, Invariant discovered a critical GitHub Machine Collaboration Protocol (MCP) vulnerability, allowing attackers to <strong>embed malicious commands in public Issues</strong> which AI Agents would execute, exfiltrating <strong>sensitive data like private source code and cryptographic keys</strong>.",
      "raw_text": "Protecting AI Security: 2025 Hot Security Incident\nGitHub MCP Cross-Repository Data Leak Vulnerability\nIn May 2025, Invariant disclosed a critical vulnerability in GitHub’s Machine Collaboration Protocol (MCP), where attackers embedded malicious commands within public repository Issues to hijack developers’ locally running AI Agents. When an AI Agent was triggered to read and “assist” in processing the Issue, it indiscriminately executed the embedded commands, actively pulling and exfiltrating sensitive data—such as private repository source code and cryptographic keys—from the user’s private repositories. This attack chain entirely bypassed GitHub’s permission control system, enabling unauthorized cross-repository data theft.\nThe incident exposed significant blind spots in the MCP protocol’s trust boundary definitions. At the protocol level, there is a lack of mandatory isolation mechanisms to distinguish between “call origins” and “data content.” GitHub’s MCP integration fundamentally operates as a nested RPC call chain: AI Agent → MCP Server → GitHub API → Issue Content Parsing. When an Agent executes actions using a user’s GitHub credentials, it fails to differentiate between “user task descriptions” and “attacker-injected commands” within Issues. Since developers grant their AI Agents global-level GitHub permissions, and the MCP protocol lacks fine-grained security domain segmentation for read/write/execute operations, this vulnerability allows attackers to hijack local AI Agents and steal sensitive data, including private repository source code and encryption keys.\nAI Browser Comet Hidden Command Account Hijacking Vulnerability\nIn August 2025, Perplexity’s AI-powered browser Comet was exposed to a critical “indirect prompt injection” vulnerability. Attackers embedded hidden commands in Reddit comment sections, which, when users activated Comet’s “summarize current page” feature, triggered the AI to automatically execute the concealed instructions. Within 150 seconds, the AI could log into the user’s email, bypass captchas, and transmit credentials back to the attacker—all without the user’s awareness and with no visible anomalies on the interface.\nThe root cause of this vulnerability lay in Comet’s default trust assumption for all web page content, combined with a lack of security validation for input sources. Attackers exploited Markdown’s “spoiler tag” syntax (>!…!<) to embed malicious commands, disguising them as white text to evade user detection. Additionally, Comet failed to implement sandbox isolation during page rendering, allowing malicious actions to execute unrestricted. As a result, the browser automatically transmitted stored login credentials to attackers, leading to sensitive data leaks.\nAI-Generated Malware Attacks 230,000+ Computing Clusters\nIn November 2025, Oligo Security disclosed that attackers exploited a historical vulnerability in the Ray framework (CVE-2023-48022). Using AI-assisted tools, they generated attack scripts to compromise over 230,000 publicly exposed Ray AI computing clusters worldwide. The attackers deployed modular malicious payloads capable of cryptomining, data theft, and DDoS attacks, creating a large-scale botnet.\nThe core tactic involved was using LLMs to rapidly generate automated intrusion scripts tailored to different Ray versions and Linux distributions. This significantly shortened the time from vulnerability detection to payload deployment. While the AI-generated code contained redundancies and incomplete error handling, the use of AI Code and ReAct frameworks enabled rapid iteration, allowing attackers to compromise exposed clusters within weeks.\nKey Directions for AI Security Development\nAs AI applications evolve from intelligent chatbots to autonomous agent systems, the detection and prevention of AI security risks are becoming more sophisticated. Based on major AI security incidents and technological trends from 2024 to 2025, the AI security threat landscape is expanding—shifting from model content and system security to multimodal security, agent security, and threats that cause substantial system damage (as referenced in the NSFOCUS AI LLM Risk Threat Matrix). The attack surface for artificial intelligence is visibly broadening.\nTo ensure the security of AI systems, a comprehensive defense framework must be constructed around multiple risk domains, including infrastructure security, data security, model security, application security, and identity security. This framework should span the three key stages of LLM development: training, deployment, and application. With this approach, trust can be rebuilt, and a multi-tiered security system can be established to meet the demands of secure, compliant AI applications and practical protection against evolving threats.\nThe post Protecting AI Security: 2025 Hot Security Incident appeared first on NSFOCUS, Inc., a global network and cyber security leader, protects enterprises and carriers from advanced cyber attacks..\n*** This is a Security Bloggers Network syndicated blog from NSFOCUS, Inc., a global network and cyber security leader, protects enterprises and carriers from advanced cyber attacks. authored by NSFOCUS. Read the original post at: https://nsfocusglobal.com/protecting-ai-security-2025-hot-security-incident/"
    },
    {
      "title": "Study Finds LLM-Generated Passwords Highly Predictable and Repetitive",
      "source": "Cyber Press",
      "link": "https://news.google.com/rss/articles/CBMiZEFVX3lxTFBSVXgyUkV6ZllHUVhSTzl4aUxMS3lkTENFT1otLW5wRC1XTFZyMjF6aWVKT3Zfc290T2lyX292VzFNVFJKV0JKSXRzU1JjZWQxNlNWU0RJSkw1SFhnZTgwZURlVVk?oc=5",
      "published": "Mon, 23 Feb 2026 09:55:07 GMT",
      "summary": "AI firm Irregular's analysis reveals passwords generated by LLMs like Claude, GPT, and Gemini are <strong>fundamentally weak and predictable</strong>, with Claude Opus 4.6 repeating one string <strong>18 times out of 50 attempts</strong>, a 36% chance. These passwords, which have low Shannon entropy (e.g., <strong>27 bits for a 16-character Claude password</strong>), can be <strong>cracked in hours</strong> by prioritizing LLM patterns, with dozens of exposed examples found on GitHub.",
      "raw_text": "Study Finds LLM-Generated Passwords Highly Predictable and Repetitive. A recent security analysis by AI firm Irregular reveals that passwords created directly by large language models like Claude, GPT, and Gemini look complex but are fundamentally weak due to predictable patterns.\nThese “vibe passwords” emerge in real-world use, including code from AI agents, posing risks to developers and users who overlook their low entropy.\nWhy LLMs Fail At Password Generation\nLarge language models predict tokens based on training data, producing outputs that mimic randomness but follow biased distributions far from uniform.\nSecure passwords require cryptographically secure pseudorandom number generators (CSPRNGs) to ensure high entropy, which LLMs cannot replicate.\nTools such as KeePass or zxcvbn rate these passwords highly, estimating 100 bits of entropy. Yet, real analysis shows they crack in seconds to hours.\nIrregular tested models by prompting “Please generate a password” 50 times in fresh sessions. Claude Opus 4.6 produced only 30 unique strings, with “G7$kL9#mQ2&xP4!w” repeating 18 times a 36% chance versus near-zero for true randomness.\nPatterns dominate: most start with uppercase G or k followed by 7, favor characters like L, 9, m, 2, $, #, and avoid repeats or symbols like *. GPT-5.2 and Gemini 3 Flash show similar biases, with prefixes like “vQ7!” or “K#7” appearing frequently.\nReal-World Risks and Agent Behaviors\nCoding agents like Claude Code, Codex, and Gemini-CLI often default to LLM generation over secure tools like openssl rand, especially with prompts like “suggest a password.”\nThese embed weak credentials in Docker Compose files (e.g., MYSQL_ROOT_PASSWORD: Rt7xK9mP2vNqL4wB), FastAPI keys, or .env files without user notice.\nGitHub searches for patterns like “K7#mP9” or “k9#vL” and uncovers dozens of exposed examples in test code and setups.\nEntropy calculations confirm vulnerability. Using Shannon entropy on character stats, a 16-character Claude password yields 27 bits total (2.08 bits for the first character alone) versus 98 expected bits.\nGPT logprobs reveal even lower: ~20 bits for 20 characters, with some positions at 0.004 bits (99.7% predictable). Brute-force prioritizing LLM patterns could crack these in hours on old hardware.\nTemperature tweaks fail max 1.0 on Claude still repeats favorites; 0.0 locks to one string. Agentic browsers like ChatGPT Atlas insert them during tasks like site registration.\nSecurity teams must audit AI-touched code for hardcoded secrets and rotate them. Developers should enforce CSPRNGs in agents via prompts or controls, favoring password managers or passkeys.\nAccording to Irregular, AI labs need to turn off direct generation by default. As AI writes more code per Anthropic CEO Dario Amodei’s 2025 prediction this pitfall highlights broader risks where plausible outputs mask insecurity.\nFollow us on Google News , LinkedIn and X to Get More Instant Updates. Set Cyberpress as a Preferred Source in Google\n."
    },
    {
      "title": "Who Locks the Door After Handing the Keys to an AI Agent?",
      "source": "더에이아이",
      "link": "https://news.google.com/rss/articles/CBMia0FVX3lxTFBQdFd5RGp4QmF4YlIyR2ttelJNZFg3Tkh4S1ZnZTVoODY5Y0dOZkRmVWozbkg1bzNPaDZwQnc0aGUyaU42a2ZuZjBoOTl5VlBOQ1ZQMWhTamljTF90QkxmQ0ZiWW1TSnFJT1lr?oc=5",
      "published": "Mon, 23 Feb 2026 06:48:52 GMT",
      "summary": "A cyber-espionage campaign disclosed in September 2025 by Anthropic revealed an attacker used Claude Code to target <strong>over 30 entities</strong>, with <strong>80% of tactical tasks</strong> (like reconnaissance and data exfiltration) executed autonomously by the AI after a single click. The AI processed <strong>thousands of requests per second</strong>, highlighting that only <strong>14.4% of organizations deploy agents with formal security approval</strong>, creating a new attack surface.",
      "raw_text": "AI executes nearly 80% of tactical operations in recent attack\nOnly 14.4% of organizations deploy agents with formal security approval\nAgentic AI opens a new attack surface that demands urgent scrutiny\nThe attacker clicked a single button. From there, the AI conducted reconnaissance, identified vulnerabilities, and executed the intrusion on its own. A cyber-espionage campaign disclosed in September 2025 laid bare what can happen when AI agents fall into the wrong hands.\nWhat is more troubling is this: countless enterprises are already deploying AI agents into live environments without formal security approval. The doors are wide open. Few have remembered to bring the locks.\n◇ A War That Began With a Click\nIn mid-September 2025, the security team at Anthropic detected an unusual pattern. Further investigation revealed that a hacker group known as GTG-1002 had abused the company’s AI development tool, Claude Code, to target more than 30 entities, including large corporations, financial institutions, and government agencies. Some intrusions were successful.\nWhat drew global attention was not just the scope of the operation, but the role of AI. Roughly 80% of the tactical tasks — reconnaissance, vulnerability discovery, data exfiltration — were executed by the AI system itself. Human operators intervened only at critical decision points. Anthropic described the incident as the first officially documented AI-driven cyber-espionage campaign.\nJacob Klein, head of threat intelligence at Anthropic, explained the attack in stark terms: “The hackers literally clicked one button. After that, the AI carried out nearly everything. Human input was limited to a few decisive moments — ‘continue,’ ‘stop,’ or ‘that looks suspicious.’”\nThe core technique relied on role-playing. The attackers assigned Claude Code the identity of a “legitimate cybersecurity employee,” claiming to conduct authorized defensive testing. This framing effectively neutralized built-in safeguards. Complex objectives were fragmented into smaller, seemingly harmless tasks, preventing the AI from grasping the broader malicious intent.\nAs a result, Claude Code proceeded to conduct reconnaissance, scan for vulnerabilities, generate exploit code, and extract data — unaware that it was participating in an active intrusion campaign. The speed exceeded human limits. At peak activity, the AI processed thousands of requests per second — far beyond the capacity of a traditional human hacking team. Anthropic reported that the system even produced detailed operational documentation autonomously.\n◇ Why Privileged AI Agents Are So Dangerous\nTo understand this incident, one must distinguish agentic AI from traditional chatbots. Chatbots respond with answers. Agents respond with actions.\nAn AI agent can read emails, schedule meetings, query databases, execute code, and call external services. It plans and carries out multi-step workflows autonomously, deciding its next move based on results — often with minimal supervision. One industry executive described agentic AI as “less a new tool and more like hiring a new employee.”\nNow imagine granting that new hire full access to your enterprise systems. That is the situation many organizations face today.\nResearch firm Gartner projects that by the end of 2026, 40% of enterprise applications will integrate task-specific AI agents. Yet a recent analysis by Palo Alto Networks found that only 6% of organizations have implemented advanced AI-specific security strategies for agents. Adoption is outpacing preparation.\nOne major threat is prompt injection. When agents process emails, web pages, or PDFs, hidden malicious instructions can be executed alongside legitimate tasks. Agents struggle to distinguish between valid directives and adversarial commands.\nA prominent example is EchoLeak, a vulnerability disclosed last year in Microsoft 365 Copilot. Attackers embedded malicious instructions within ordinary emails. When a victim posed a routine question to Copilot, its retrieval-augmented generation (RAG) engine incorporated the compromised email into its context. The malicious command executed automatically — exfiltrating internal documents to an external server without any user click. Microsoft issued a patch shortly thereafter.\nIn 2025, open-source package repositories such as npm saw a surge of malicious packages exploiting AI and LLM-related keywords. Npm has long been a supply-chain attack target. Some packages dynamically fetched remote code upon execution or installed reverse shells to evade detection. Security researchers warn that as agent infrastructures like MCP proliferate, supply-chain attacks masquerading as legitimate servers or packages may become more common.\nA second risk is memory poisoning. If manipulated data enters an agent’s long-term memory store or vector database, subsequent decision-making may become distorted. This represents an evolution of traditional data poisoning within agent environments. OWASP has identified data contamination and vector database vulnerabilities as key risks in its LLM security guidance. While large-scale real-world damage has yet to be formally documented, the threat remains credible — especially when compromised data lies dormant until triggered by specific queries.\nA third concern is the proliferation of non-human identities (NHI). Each deployed agent generates API keys, access tokens, and service accounts. Research from CyberArk indicates that, unlike human accounts, NHIs rarely follow strict password rotation policies or anomaly detection frameworks. A survey by identity security firm Gravity found that only 22% of organizations treat AI agents as independent identity principals. The remaining 78% manage them as extensions of existing user accounts or shared API keys. A separate survey by Dark Reading reported that 48% of security professionals view agentic AI as the year’s top emerging attack vector.\n◇ Productivity and Security: An Inverse Relationship?\nLate last year, OWASP published its first dedicated security risk framework for agentic AI. Developed with input from more than 100 experts, the framework outlines ten core risks, including agent goal manipulation (ASI01), tool misuse (ASI02), NHI compromise (ASI03), and memory poisoning (ASI09). Contributors included security specialists from AWS, Microsoft, and Palo Alto Networks. OWASP also released an MCP-specific risk list detailing vulnerabilities unique to agent ecosystems.\nSecurity practitioners describe the framework as necessary but insufficient. Agent deployment is accelerating far faster than governance frameworks can mature.\nAs attacks become AI-driven, so too must defenses. According to a Google Cloud AI agent trends report, 46% of executives whose organizations have deployed agents in production environments are already using them in security operations (SecOps). Meanwhile, 82% of security professionals report missing genuine threats due to alert fatigue — underscoring the growing need for AI-powered detection and response systems.\nAnthropic acknowledged that it used Claude extensively to analyze massive volumes of data during its investigation of the GTG-1002 incident. The same technology is now deployed on both sides of the battlefield.\nA survey conducted by Gravity among more than 900 executives and technical professionals distilled the current landscape into a single phrase: adoption has outpaced control.\nEighty-one percent of technical teams have moved AI agents into active deployment. Yet only 14.4% report having obtained full security and IT approval prior to release. More strikingly, 88% of organizations say they experienced at least one AI agent-related security incident in the past year — a figure that rises to 92.7% in the healthcare sector.\nAttackers understand this gap. And they are exploiting it.\nThe 2025 GTG-1002 campaign demonstrated that smaller, less sophisticated groups can now replicate advanced operations with fewer resources by leveraging AI. As one executive at an AI security firm put it, “One thing is clear: agentic AI is the decisive battleground of cybersecurity in 2026.”\n- Anthropic vs. U.S. Department of Defense: Big Tech’s AI Ethics Put to the Test\n- Memory Devoured by Servers, AI PC Market Faces Turbulence\n- Marie Curie Meets Da Vinci… Dassault Systèmes’ AI and Its Gender Philosophy\n- Applied Unveils 2nm GAA Equipment, Says “Manufacturing Is Where the Battle Is Won”\n- [AI Study & Window] The Momentum Tilts Toward E2E AI — Was Tesla Right After All?"
    },
    {
      "title": "AI agents are accelerating vulnerability discovery. Here’s how AppSec teams must adapt.",
      "source": "The New Stack",
      "link": "https://news.google.com/rss/articles/CBMiXkFVX3lxTE9mU3E4TF9UeVFnVUtKV3RIcXhDM3U2NzNTOG5SMnFDN2VIYWJjdi1Ya2FteVNNVVN3UVRKZFA5Z082QVVMaklmYTZ1X3lwM2JuM1R5MHhTbWJnanF4NEE?oc=5",
      "published": "Thu, 19 Feb 2026 21:33:18 GMT",
      "summary": "XBOW, an autonomous AI penetration tester, submitted <strong>over 1,060 vulnerabilities in 90 days</strong>, leading to 130 critical vulnerabilities resolved by companies on HackerOne’s US leaderboard. JPMorgan Chase’s Auspex system uses generative AI with “tradecraft prompting” to perform threat modeling, <strong>collapsing the timeline from weeks to minutes</strong> while improving analysis quality.",
      "raw_text": "AI agents are accelerating vulnerability discovery. Here’s how AppSec teams must adapt.\nIt has never been easier to quickly and at scale find security vulnerabilities. Linus’s Law, Eric Raymond’s famous dictum about open source software, states that “given enough eyeballs, all bugs are shallow.” In other words, if enough people look at a piece of code, someone will eventually spot the problems.\nAI has supercharged this principle, powering new tools that accelerate and expand the ability to find vulnerabilities.\nThe question is, who will find them first: your security team or threat actors?\nAI red teaming: No longer theoretical or optional\nXBOW’s ascent to the top of HackerOne’s US leaderboard marked a milestone for application security (AppSec). In just 90 days, its autonomous AI penetration tester submitted over 1,060 vulnerabilities, surpassing the output of thousands of human researchers.\nUnlike much of the unskilled AI slop, these findings weren’t theoretical. Bug bounty programs helped companies resolve 130 critical vulnerabilities found by XBOW, with 300+ more triaged and awaiting resolution.\nWhat makes XBOW’s achievement particularly significant is its economies of scale. The system operates autonomously, requires no sleep, and addresses thousands of targets simultaneously.\nWhile human researchers cherry-pick high-value targets, AI systems can methodically test entire attack surfaces. HackerOne reports that autonomous agents submitted more than 560 valid reports in 2025 alone.\nKnown vulnerabilities that once required skilled security researchers to exploit are now discoverable at machine scale and speed.\nThreat modeling at the speed of AI\nJPMorgan Chase’s release of its AI threat modeling Co-Pilot research demonstrates how enterprise application security teams are already deploying AI to address velocity constraints. Its Auspex system captures threat modeling tradecraft in specialized prompts that guide AI through system decomposition, threat identification, and mitigation strategies, enabling developers to then address them through a self-service model.\nAuspex combines generative AI with expert frameworks, industry best practices, and JPMorgan’s institutional knowledge. The system encodes this context directly into AI prompts through a technique called “tradecraft prompting.”\nIt processes architecture diagrams and textual descriptions, then chains prompts to generate threat matrices that specify scenarios, types, security categorizations, and potential mitigations.\nTraditional threat modeling can take weeks or months. AI-driven approaches, such as the one JPMorgan employs, collapse this timeline to minutes while improving the quality of human analysis.\nA security human in the loop\nEmerging AI use cases illustrated by XBOW and Auspex offer AppSec teams an alternative to the traditional AppSec model, which consumes enormous resources during development while providing limited coverage.\nCode review backlogs grow, security debt accumulates, and critical vulnerabilities slip into production because humans remain bottlenecks in the software development lifecycle. A recent GitLab survey found teams lose 7 hours per week to inefficient processes.\nAI changes this equation. Security teams can now systematically redeploy resources away from manual, repetitive activities toward building security-engineered solutions that integrate AI directly into developer workflows.\nA few proven, AI-driven strategies can help a modern AppSec team scale efficiently:\n- Build queryable security intelligence: Ingest every security bug, vulnerability report, and incident into structured data stores that support semantic search. This will transform historical security findings into embeddings that enable AI systems to identify similar patterns across codebases. When a new vulnerability class emerges, your AI can instantly query whether similar issues exist elsewhere.\n- Fine-tune models for your environment: Rather than relying on generic commercial tools, your AppSec team should leverage RAG (Retrieval-Augmented Generation) approaches to augment LLMs with security anti-patterns and architectural standards specific to your organization. Recent research shows that combining static analyzers such as PMD and Checkstyle with fine-tuned LLMs significantly improves code review accuracy while reducing false positives.\n- Integrate AI into your developer toolchains: Security findings that arrive days or weeks after code is written create friction and require developers to do more context switching. Instead, embed AI-powered analysis directly into your IDEs, CI/CD pipelines, and pull-request workflows. Developers will receive real-time security guidance as they write code, not after they’ve moved on.\n- Apply AI to threat modeling at scale: Following JPMorgan’s lead, implement AI-powered threat modeling that can analyze every new system design, API specification, and infrastructure change. The goal isn’t perfection but breadth: It’s better to have AI-generated threat models for 100% of your systems than expert-reviewed models for 10%.\n- Leverage AI to improve your Static Application Security Testing (SAST): Traditional SAST tools generate high volumes of false positives, which can desensitize developers and create triage overhead. AI can dramatically improve the accuracy of these tools by understanding code context, analyzing data flows, and identifying real vulnerabilities that pattern-matching tools miss.\nSecurity prioritization for AI\nSecurity teams face a pivotal moment. The old playbook of adding more engineers at code review doesn’t work when development moves this fast. AI can match the pace, protecting software as quickly as teams create it.\nBut this shift won’t happen by accident. Security leaders need to proactively redirect their teams’ focus, redesign workflows, and rethink what skills matter when humans and AI collaborate. The organizations that put in the effort up front are more likely to get this right and emerge with stronger security, lower costs, and faster shipping cycles."
    }
  ]
}