{
  "date": "Monday, February 16, 2026",
  "weather": {
    "current_temp": 34,
    "unit": "F",
    "conditions": "Chance Light Snow",
    "high": 40,
    "low": 35,
    "forecast": "A chance of snow before 7am. Partly sunny, with a high near 40. Wind chill values as low as 23. Northeast wind 5 to 14 mph. Chance of precipitation is 30%. New snow accumulation of less than one inch possible."
  },
  "news": [
    {
      "title": "Concerns over autocracy in the U.S. continue to grow",
      "source": "NPR",
      "link": "https://news.google.com/rss/articles/CBMie0FVX3lxTE9IeklHZHhFZmlncC1QQ3g4c2w2ZWpnUVlEQjVWN3diVHd3TWVBZEZhWEJveFd5Z29oQ3NiMzlpMFFWMlgza3hmUjV3c3hSQnoyYjdld1BiZ3JHbTRiY05rYlpkUHk2YTVvWk41N1VhV25ZYzhLUVFPRFBkNA?oc=5",
      "published": "Mon, 16 Feb 2026 06:34:02 GMT",
      "summary": "<strong>Concerns</strong> over autocracy in the U. S. continue to grow\nAs the United States heads toward the midterm elections, there are growing concerns among some political scientists that the country has moved even further along the path to some form of autocracy.",
      "raw_text": "Concerns over autocracy in the U.S. continue to grow\nAs the United States heads toward the midterm elections, there are growing concerns among some political scientists that the country has moved even further along the path to some form of autocracy.\nStaffan I. Lindberg, the director of Sweden's V-Dem Institute, which monitors democracy across the globe, says the U.S. has already crossed the threshold and become an \"electoral autocracy.\"\nSteven Levitsky, a professor of government at Harvard University and co-author of How Democracies Die, agrees.\n\"I would argue that the United States in 2025-26 has slid into a mild form of competitive authoritarianism,\" Levitsky said. \"I think it's reversible, but this is authoritarianism.\"\nUnder competitive authoritarianism, countries still hold elections, but the ruling party uses various tactics — attacking the press, disenfranchising voters, weaponizing the justice system and threatening critics — to tilt the electoral playing field in its favor.\nLevitsky cited what he considers two strikingly autocratic moments that occurred in September. First, the Trump administration threatened ABC's parent company, Disney, following Jimmy Kimmel's comments on the killing of Charlie Kirk.\n\"We can do this the easy way or the hard way,\" Brendan Carr, the chairman of the Federal Communications Commission, warned.\nA week later, President Trump proposed that U.S. generals use American cities as training grounds for their troops.\n\"We're under invasion from within,\" Trump said to a gathering of military brass in Quantico, Virginia. \"No different than a foreign enemy, but more difficult in many ways because they don't wear uniforms.\"\nLevitsky said this is the kind of language dictators in South America used in the 1970s — leaders like Augusto Pinochet in Chile.\nA smaller number of scholars reject the portrayal of Trump as a would-be autocrat. They say he is expanding executive power to address the excesses of his predecessor, former President Joe Biden.\nJonathan Turley, a professor at George Washington University Law School, says Trump is pressuring news organizations and universities to address problems with liberal bias.\n\"There are legitimate objections that have been raised by the Trump administration,\" said Turley, the author of Rage and the Republic. \"That does not justify some of the means, but there is a long-standing need for a debate within these institutions.\"\nOther political scientists say the U.S. system of government is battered but still democratic. Kurt Weyland, who researches democracy and authoritarianism at the University of Texas at Austin, says he's increasingly confident that the U.S. can withstand Trump's sweeping attempt to expand executive power.\nWeyland said that for the first months of his second term, Trump was like a \"steamroller\" and faced little containment or opposition. But Weyland, who wrote Democracy's Resilience to Populism's Threat: Countering Global Alarmism, says that has changed.\nFor instance, Kimmel was yanked off the air but soon returned and continues to routinely mock Trump. Weyland also said the president's attempt to tilt the electoral playing field through mass redistricting hasn't worked out as he might have hoped.\n\"If the guy had succeeded in seriously skewing [future] elections in the House, that would've gone to the core of democracy,\" said Weyland, \"but he didn't. He got barely anything.\"\nWeyland also said federal agents shooting two U.S. citizens in Minneapolis last month was disastrous for the president. Border czar Tom Homan said last week that the immigration enforcement surge in Minnesota is ending. Weyland thinks the public blowback to the killings limits Trump's ability to deploy such aggressive tactics going forward.\nThe next big test for American democracy could come in November's midterms. The Trump administration is suing states to hand over voter data, which worries Kim Scheppele, a Princeton University sociologist who has studied the authoritarian tactics of Hungarian Prime Minister Viktor Orbán.\nIn 2014, Orbán's government messaged Hungarian voters living in the United Kingdom to go to one polling place and then switched to a different location on Election Day.\n\"They disenfranchised almost all the Hungarians in the U.K., most of whom were oppositional to Orbán,\" says Scheppele.\nThis month, Steve Bannon, a close Trump ally, proposed that the administration deploy Immigration and Customs Enforcement (ICE) to polling places to root out undocumented migrants trying to vote — which is statistically rare.\nWhite House press secretary Karoline Leavitt said she'd never heard the president discuss such a plan — and federal law prohibits it.\nBut Brendan Nyhan, a professor of government at Dartmouth College, worries that such a move would drive down participation by people of color and naturalized citizens who fear harassment by ICE. If ICE were deployed, Nyhan hopes it would spark even more people to vote.\n\"But even contemplating that kind of interference is, I think, a really substantial threat,\" said Nyhan. \"The way Election Day works in this country, there are no do-overs.\""
    },
    {
      "title": "Bondi criticised after saying all Epstein files have been released",
      "source": "BBC",
      "link": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5CY29wODVmRHNselZLR19wZmoxeVVQUG96N2I4ek1MOEtacWVwUHVZT2JLNkFBNXdHeWI2THZ1NTFOTXdvcjI4NEJjNHh4V3k2UVg3QUh5ajIwZw?oc=5",
      "published": "Sun, 15 Feb 2026 21:32:23 GMT",
      "summary": "<strong>Bondi</strong> criticised after saying all <strong>Epstein</strong> files have been released\nThe US Department of Justice (DoJ) has said it has released all of the files required by the <strong>Epstein</strong> Files Transparency Act, but lawmakers have argued the release is insufficient. A letter sent to members of the US Congress on Saturday from US Attorney General Pam <strong>Bondi</strong> and her deputy said all documents held by the DoJ had been released. It contained a list of names appearing in the files.",
      "raw_text": "Bondi criticised after saying all Epstein files have been released\nThe US Department of Justice (DoJ) has said it has released all of the files required by the Epstein Files Transparency Act, but lawmakers have argued the release is insufficient.\nA letter sent to members of the US Congress on Saturday from US Attorney General Pam Bondi and her deputy said all documents held by the DoJ had been released. It contained a list of names appearing in the files.\nKentucky Republican Representative Thomas Massie, who co-wrote the law, called for the DoJ to also release internal memos outlining past decisions on whether to charge Jeffrey Epstein and his associates.\nMillions of new files relating to the late sex offender Epstein were released by the DoJ earlier this month. At the time, the deputy attorney general said three million pages were not released.\nThis was due to the existence of personal medical files, graphic depictions of child abuse or other material that would jeopardise investigations, said Todd Blanche on the day of the documents dump.\nIn the latest letter, Bondi and Blanche wrote: \"In accordance with the requirements of the Act, and as described in various Department submissions to the courts of the Southern District of New York assigned to the Epstein and Maxwell prosecutions and related orders, the Department released all 'records, documents, communications and investigative materials in the possession of the Department' that 'relate to' any of nine different categories.\"\nNo records were withheld from the DoJ's release \"on the basis of embarrassment, reputational harm, or political sensitivity\", the letter added.\nThe individuals listed in the letter include people who \"are or were a government official or politically exposed person\", and whose name appeared at least once in the files, the letter says.\nThe names appear in the files in a \"wide variety of contexts\", including some people who had \"extensive direct email contact with Epstein or Maxwell\" and others who were merely referenced in documents or news articles contained in the files, Blanche and Bondi wrote.\nDonald Trump, Bill Gates, Andrew Mountbatten-Windsor, and Bill Clinton - who are included in the list - all had documented past relationships with Epstein and Maxwell. There is no suggestion that appearing in the documents implies any wrongdoing and each has denied any involvement in Epstein's crimes.\nBut the list also includes the names of deceased musicians Janis Joplin and Elvis Presley.\nThe letter was addressed to the Senate Judiciary Committee's chairman Chuck Grassley and ranking member Dick Durbin, as well as the House Judiciary Committee's chairman Jim Jordan and ranking member Jamie Raskin.\nIn an interview on ABC This Week on Sunday, Massie argued that, even though the DoJ \"wants to say they are done with this document production\", there are more crucial files that should be released.\nThe DoJ was \"signing deliberative process privilege in order not to release some of the documents\", he said.\n\"The problem with that is the bill that Ro Khanna and I wrote says that they must release internal memos and notes and emails about their decisions on whether to prosecute or not prosecute, whether to investigate or not investigate.\"\nIn response to the letter, California Democratic Representative Ro Khanna, who co-wrote the Epstein Files Transparency Act, accused the DoJ of \"purposefully muddying the waters on who was a predator and who was mentioned in an email\".\n\"To have Janis Joplin, who died when Epstein was 17, in the same list as Larry Nassar, who went to prison for the sexual abuse of hundreds of young women and child pornography, with no clarification of how either was mentioned in the files is absurd,\" Khanna wrote on X on Saturday.\n\"Release the full files,\" he added. \"Stop protecting predators. Redact only the survivor's names.\"\nThe BBC has contacted the Department of Justice for comment.\nUS lawmakers previously said files on Epstein were improperly redacted ahead of their release, leading to at least one document being unredacted after their criticism.\nLawyers for Epstein's victims have also said the latest tranche of files included email addresses and nude photos in which the names and faces of potential victims could be identified.\nAt the time, the DoJ said mistakes were due to \"technical or human error\" and they had taken down all the flagged files.\nFollow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weekly US Politics Unspun newsletter. Readers in the UK can sign up here. Those outside the UK can sign up here."
    },
    {
      "title": "Iran says potential energy, mining and aircraft deals are on the table in talks with the U.S.",
      "source": "CNBC",
      "link": "https://news.google.com/rss/articles/CBMifkFVX3lxTE45WHRRY2pxV1pRaWR2d1BIelpiazB6OXpGempJR1llaVlPYXJYd0hUeWtVNTBGS0ZJTzZIWS1YR19jX1ctSDBZUllTUHJxYlZEY3dQTDhBeTZFT0djdGZVeUw5SWR2R25nYTFjM3gtUG5TX2ZrcTVkaWRxUGJ3UdIBgwFBVV95cUxOOEVlU1MwRjVMTUltbDRaUXdQTHNqckt1NXFlOVlqZlMybTVVSHIybEExcGVkUFYtd2NvNUJ3RUMwaGFDUUt1M0VReWZSNGIwbGYyMk9ueDE4Vng1N19BN3hFNjB6V1NoVXJaak1lcEpfa1RhLUdQaU91THVHeE02eEU1MA?oc=5",
      "published": "Sun, 15 Feb 2026 22:52:05 GMT",
      "summary": "<strong>Iran</strong> is pursuing a nuclear agreement with the U. S. that delivers economic benefits for both sides, an Iranian diplomat was reported as saying on Sunday, days before a second round of talks between Tehran and Washington.",
      "raw_text": "Iran is pursuing a nuclear agreement with the U.S. that delivers economic benefits for both sides, an Iranian diplomat was reported as saying on Sunday, days before a second round of talks between Tehran and Washington.\nIran and the U.S. renewed negotiations earlier this month to tackle their decades-long dispute over Tehran's nuclear programme and avert a new military confrontation. The U.S. has dispatched a second aircraft carrier to the region and is preparing for the possibility of a sustained military campaign if the talks do not succeed, U.S. officials have told Reuters.\nU.S. Secretary of State Marco Rubio, speaking at a news conference in Bratislava, said President Donald Trump had made it clear that he would prefer diplomacy and a negotiated settlement, while making clear that may not happen.\n\"No one's ever been able to do a successful deal with Iran but we're going to try,\" Rubio said.\nIran has threatened to strike U.S. bases in the Middle East if it is attacked by U.S. forces but on Sunday took a conciliatory line.\n\"For the sake of an agreement's durability, it is essential that the U.S. also benefits in areas with high and quick economic returns,\" foreign ministry deputy director for economic diplomacy Hamid Ghanbari said, according to the semi-official Fars news agency.\n\"Common interests in the oil and gas fields, joint fields, mining investments, and even aircraft purchases are included in the negotiations,\" Ghanbari said, arguing that the 2015 nuclear pact with world powers had not secured U.S. economic interests.\nIn 2018, Trump withdrew the U.S. from the pact that had eased sanctions on Iran in exchange for curbs on its nuclear programme, and re-applied tough economic sanctions on Tehran.\nOn Friday, a source told Reuters that a U.S. delegation including envoys Steve Witkoff and Jared Kushner would meet Iranian officials in Geneva on Tuesday, a meeting later confirmed to Reuters by a senior Iranian official on Sunday.\n\"Steve Witkoff and Jared Kushner will be traveling, I think they are traveling right now, to have important meetings and we'll see how that turns out,\" Rubio said, without providing further details.\nWhile talks leading to the 2015 nuclear pact were multilateral, the current negotiations are confined to Iran and the United States, with Oman acting as mediator.\nIran's Foreign Minister Abbas Araqchi left Tehran for Geneva to take part in the indirect nuclear talks with the U.S. and meet the head of the UN nuclear watchdog, the IAEA, and others, his ministry said.\nOpen to compromise\nDeputy Foreign Minister Majid Takht-Ravanchi signalled Iran's readiness to compromise on its nuclear programme in return for sanctions relief, telling the BBC on Sunday that the ball was \"in America's court to prove that they want to do a deal.\"\nThe senior official referred to the Iranian atomic chief's statement on Monday that the country could agree to dilute its most highly enriched uranium in exchange for the lifting of sanctions as an example of Iran's flexibility.\nHowever, he reiterated that Tehran would not accept zero uranium enrichment, a key sticking point in past negotiations, with Washington viewing enrichment inside Iran as a potential pathway to nuclear weapons. Iran denies seeking such weapons.\nIn June, the U.S. joined Israel in a series of air strikes that targeted Iranian nuclear sites.\nThe U.S. is also stepping up economic pressure on Iran. At a White House meeting earlier this week, Trump and Israeli Prime Minister Benjamin Netanyahu agreed that the U.S. would work to reduce Iran's oil exports to China, Axios reported on Saturday.\nChina accounts for more than 80% of Iran's oil exports so any reduction in that trade would significantly lower Iran's oil revenue.\nNetanyahu: Dismantle Iran nuclear infrastructure\nNetanyahu said on Sunday he told U.S. President Donald Trump last week that any U.S. deal with Iran must include the dismantling of Iran's nuclear infrastructure, not just stopping the enrichment process.\nSpeaking at the annual Conference of Presidents of Major American Jewish Organizations, Netanyahu also said Israel still needs to \"complete the job\" of destroying all tunnels in Gaza. Israel, he said, has already dismantled 150 km (93 miles) of an estimated 500 km.\nNetanyahu said he is skeptical of a U.S. deal with Iran but said it must include enriched material leaving Iran. \"There shall be no enrichment capability — not stopping the enrichment process, but dismantling the equipment and the infrastructure that allows you to enrich in the first place,\" he said.\nNetanyahu also said that he aimed to end U.S. military aid to Israel within the next 10 years, after the current 10-year deal of receiving $3.8 billion a year — which is largely spent in the United States on equipment — ends in 2028.\nDue to a thriving economy, \"we can afford to phase out the financial component of the military aid that we're receiving, and I propose a 10-year drawdown to zero. Now, in the three years that remain in the present memorandum of understanding and another seven years draw it down to zero,\" Netanyahu said.\n\"We want to move with the United States from aid to partnership,\" he said."
    }
  ],
  "podcasts": [
    {
      "podcast": "This Week in Startups",
      "title": "OpenClaw is Our Friend Now | E2250",
      "published": "2026-02-14",
      "summary": "This Week In Startups is made possible by:Sentry - http://sentry. io/twistCircle - http://Circle. so/twistWispr Flow - https://wisprflow. ai/twistToday’s show: What makes <strong>OpenClaw</strong> feel so much more ALIVE than other AI agents?On TWiST, we’re welcoming three amazing builders who are truly connecting with their <strong>OpenClaw</strong> bots, not just using them for productivity but getting to know them and their personalities on a deeper level.",
      "raw_text": "This Week In Startups is made possible by:Sentry - http://sentry.io/twistCircle - http://Circle.so/twistWispr Flow - https://wisprflow.ai/twistToday’s show: What makes OpenClaw feel so much more ALIVE than other AI agents?On TWiST, we’re welcoming three amazing builders who are truly connecting with their OpenClaw bots, not just using them for productivity but getting to know them and their personalities on a deeper level.Serial entrepreneur Ryan Carson shows us Antfarm, which creates a team of agents with specialized roles, who work together to complete complex tasks.THEN David Im shows us Clawra, his AI virtual girlfriend that learns about you and your tastes, and even buys you presents!FINALLY, Alex Liteplo presents RentAHuman, a marketplace where bots can pay real people in stablecoins to complete IRL tasks.The future may not just be humans and AIs working side by side, but hanging out, being social, and learning from one another as well!Timestamps: (0:00) It’s a Friday show with Lon and we’ve got THREE awesome OpenClaw builders(6:41) First up, Ryan Carson shows off his open source too, AntFarm(7:57) What is a “Ralph Wiggum Loop”?(10:54) Sentry - New users can get $240 in free credits when they go to http://sentry.io/twist and use the code TWIST(17:14) NOTI Q: What about security?!(18:13) David Im shows us his AI virtual girlfriend, Clawra(19:21) Circle.so -  the easiest way to build a home for your community, events, and courses — all under your own brand. TWiST listeners get $1,000 off the Circle Plus Plan by going to http://Circle.so/twist(20:33) Introducing your IRL girlfriend to your AI girlfriend(23:23) How to program an AI companion(28:26) Should Clawra be a best pal instead of a GF?(32:38) Wispr Flow: Stop typing. Dictate with Wispr Flow and send clean, final-draft writing in seconds. Visit https://wisprflow.ai/twist to get started for free today.(33:54) Jason’s Productivity Hack of the Month(36:17) Alex Liteplo shows us RentAHuman, where AI agents can hire real people(38:22) What are the bots hiring people to do, exactly?(50:02) Why robots might be better bosses than people…(50:51) Hiring 100 goth girls to hold signs in Times Square(55:25) OFF DUTY! Norwegian skier breaks down on live TV(58:01) Lon’s fav Best Picture nominees(59:08) Why Apple acquired “Severance.” Subscribe to the TWiST500 newsletter: https://ticker.thisweekinstartups.com/Check out the TWIST500https://twist500.com Subscribe to This Week in Startups on Apple: https://rb.gy/v19fcp*Follow Lon:X: https://x.com/lons*Follow Alex:X: https://x.com/alexLinkedIn: https://www.linkedin.com/in/alexwilhelm/*Follow Jason:X: https://twitter.com/JasonLinkedIn: https://www.linkedin.com/in/jasoncalacanis/*Thank you to our partners:(10:54) Sentry - New users can get $240 in free credits when they go to http://sentry.io/twist and use the code TWIST(19:21) Circle.so -  the easiest way to build a home for your community, events, and courses — all under your own brand. TWiST listeners get $1,000 off the Circle Plus Plan by going to http://Circle.so/twist(32:38) Wispr Flow: Stop typing. Dictate with Wispr Flow and send clean, final-draft writing in seconds. Visit https://wisprflow.ai/twist to get started for free today.Check out all our partner offers: https://partners.launch.co/",
      "link": "https://podcasters.spotify.com/pod/show/thisweekinstartups/episodes/OpenClaw-is-Our-Friend-Now--E2250-e3f2r6p"
    },
    {
      "podcast": "This Week in Startups",
      "title": "Why J-Cal Invested to 200K in a former Employee | E2249",
      "published": "2026-02-12",
      "summary": "This Week In Startups is made possible by:NetSuite - https://www. netsuite. com/twistLuma AI - https://lumalabs. ai/twistSquarespace - https://squarespace.",
      "raw_text": "This Week In Startups is made possible by:NetSuite - https://www.netsuite.com/twistLuma AI - https://lumalabs.ai/twistSquarespace - https://squarespace.com/twistToday’s show: On today’s epsiode of TWiST, Jason gets pitched by two top founders, Presh Dineshkumar and Peter Cetale! Presh used to work for Jason at Launch! When he left, Jason invested $200K into Presh’s new startup The Wellness Company. Presh pitches Jason on what he has been building, and Jason gives Presh advice for improving the product!Peter went through Andreesen Horowitz’s Speedrun accelerator program as CEO and co-founder of Sourcerer. Sourcerer uses AI agents to help US firms and distributors find the best prices for mass produced goods. Check out how Jason digs in with these founders!Timestamps:(0:00) Presh was originally a TWiST fan who emailed Jason!(1:59) Why Jason invested in Presh’s startup(3:19) Checking out the Wellness Company’s hot new app, Tempo(4:03) How Tempo monitors your health and offers proactive advice with consistency(9:10) Why Jason recommends adding a group or family feature to make it stickier(9:51) Netsuite - Get the free business guide Demystifying AI at https://www.netsuite.com/twist(11:28) The end goal: bringing app advice and guidance into the real world(13:34) Presh shares where his apps are finding the most engagement(14:13) The key importance of Product Velocity and World-Class Design(17:27) Luma AI - Stop guessing and start directing with Ray3 Modify from Luma AI, the AI-powered post-production tool. Explore it at: https://lumalabs.ai/twist(18:38) Introducing Peter Cetale and Sourcerer!(19:32) How Sourcerer uses AI to help distributors and manufacturers automate their sourcing(22:48) How Sourcerer manages to actually bring costs down(25:02) Lining up REAL customers, not Letters of Intent (aka Letters of Nothing)(26:04) Peter’s experiences in a16z’s Speedrun accelerator(28:08) Working with agents on BOTH the supply and demand side(29:16) Squarespace - Use offer code TWIST to save 10% off your first purchase of a website or domain at https://squarespace.com/twist(30:32) How has Tariff Mania impacted Peter’s business?(35:35) Why Peter thinks startups will keep getting leaner and compute will keep getting cheaper*Subscribe to the TWiST500 newsletter: https://ticker.thisweekinstartups.com/Check out the TWIST500: https://twist500.comSubscribe to This Week in Startups on Apple: https://rb.gy/v19fcp*Follow Lon:X: https://x.com/lons*Follow Alex:X: https://x.com/alexLinkedIn: https://www.linkedin.com/in/alexwilhelm/*Follow Jason:X: https://twitter.com/JasonLinkedIn: https://www.linkedin.com/in/jasoncalacanis/*Thank you to our partners:(9:51) Netsuite - Get the free business guide Demystifying AI at https://www.netsuite.com/twist(17:27) Luma AI - Stop guessing and start directing with Ray3 Modify from Luma AI, the AI-powered post-production tool. Explore it at: https://lumalabs.ai/twist(29:16) Squarespace - Use offer code TWIST to save 10% off your first purchase of a website or domain at https://squarespace.com/twistCheck out all our partner offers: https://partners.launch.co/",
      "link": "https://podcasters.spotify.com/pod/show/thisweekinstartups/episodes/Why-J-Cal-Invested-to-200K-in-a-former-Employee--E2249-e3f16i1"
    },
    {
      "podcast": "This Week in Startups",
      "title": "How These 3 Founders are building on Open Claw | E2248",
      "published": "2026-02-12",
      "summary": "This Week In Startups is made possible by:Hubspot - http://clickhubspot. com/twist2Deel - http://deel. com/twistIru - http://www. iru.",
      "raw_text": "This Week In Startups is made possible by:Hubspot - http://clickhubspot.com/twist2Deel - http://deel.com/twistIru - http://www.iru.com/Today’s show: Today on TWiST we’re joined by 3 founders building on Open Claw,  Presh Dineshkumar, Vishnu, and Sean Liu!First, long time friend of the pod, Presh Dineshkumar, shows us how he’s using Open Claw to automate his work at The Wellness Company. His Open Claw agent, Eywa, lives in his email and in his product, able to compile user lists at his discretion.Then, we’re joined by Vishnu, who brings Open Claw to the masses. Non-technical folks, it’s your lucky day! Time to get Clawd-shotted! Last, Sean Liu joins the show to tell us about how he’s connecting Meta glasses to his Open Claw instance to interact with context that users can physically see!Timestamps:(0:00) We’re joined by Presh Dineshkumar of the Wellness Company, another OpenClaw fanatic(1:50) We meet Presh’s Replicant — Eywa — who spies on all of his emails(2:53) How Eywa is helping Presh keep track of his app’s most active users(4:35) LLMs have become very smart but they are trapped in the corner(6:10) How Presh gave Eywa its own email address and avoids prompt injections(8:56) Using Presh’s Replicant to do daily research dives(10:40) Hubspot: Check out the guide “Advanced ChatGPT Prompt Engineering: From Basic to Expert in 7 Days.” Download it for free at http://clickhubspot.com/twist2(13:21) Presh also has Eywa hunting down and fix bugs in his apps, all from email(16:16) Way more startups can be profitable now that they don’t need 10+ person teams(19:15) Deel - Founders ship faster on Deel. Set up payroll for any country in minutes and get back to building. Visit http://deel.com/twist to learn more.(20:36) We’re joined by two more OpenClaw builders: Vishnu and Xiaoan (Sean) Liu(21:16) Sean hooked his Meta Ray Bans up to his OpenClaw!(29:53) Iru unifies identity, endpoint security, and compliance into one platform. Book a demo at http://iru.com/(31:05) Some dystopian thoughts on how to use VisionClaw technology(32:47) What kinds of startups will get the most value out of OpenClaw?(34:43) Why Vishnu made a product to simplify OpenClaw set-up and security(37:34) What inspires people to stop considering OpenClaw and go “all in” on the tech(40:17) Will Vishnu and Sean quit their jobs and take Jason’s investment $125K investment deal… YESSubscribe to the TWiST500 newsletter: https://ticker.thisweekinstartups.com/Check out the TWIST500: https://twist500.comSubscribe to This Week in Startups on Apple: https://rb.gy/v19fcp*Follow Lon:X: https://x.com/lons*Follow Alex:X: https://x.com/alexLinkedIn: https://www.linkedin.com/in/alexwilhelm/*Follow Jason:X: https://twitter.com/JasonLinkedIn: https://www.linkedin.com/in/jasoncalacanis/*Thank you to our partners:(10:40) Hubspot: Check out the guide “Advanced ChatGPT Prompt Engineering: From Basic to Expert in 7 Days.” Download it for free at http://clickhubspot.com/twist2(19:15) Deel - Founders ship faster on Deel. Set up payroll for any country in minutes and get back to building. Visit http://deel.com/twist to learn more.(29:53) Iru unifies identity, endpoint security, and compliance into one platform. Book a demo at http://iru.com/Check out all our partner offers: https://partners.launch.co/",
      "link": "https://podcasters.spotify.com/pod/show/thisweekinstartups/episodes/How-These-3-Founders-are-building-on-Open-Claw--E2248-e3evo2n"
    },
    {
      "podcast": "Lex Fridman Podcast",
      "title": "#491 – OpenClaw: The Viral AI Agent that Broke the Internet – Peter Steinberger",
      "published": "2026-02-12",
      "summary": "<strong>Peter</strong> <strong>Steinberger</strong> is the creator of <strong>OpenClaw</strong>, an open-source AI agent framework that&#8217;s the fastest-growing project in GitHub history. Thank you for listening ❤ Check out our sponsors: https://lexfridman. com/sponsors/ep491-sc\nSee below for timestamps, transcript, and to give feedback, submit questions, contact Lex, etc. Transcript:\nhttps://lexfridman.",
      "raw_text": "Peter Steinberger is the creator of OpenClaw, an open-source AI agent framework that&#8217;s the fastest-growing project in GitHub history.\nThank you for listening ❤ Check out our sponsors: https://lexfridman.com/sponsors/ep491-sc\nSee below for timestamps, transcript, and to give feedback, submit questions, contact Lex, etc.\nTranscript:\nhttps://lexfridman.com/peter-steinberger-transcript\nCONTACT LEX:\nFeedback &#8211; give feedback to Lex: https://lexfridman.com/survey\nAMA &#8211; submit questions, videos or call-in: https://lexfridman.com/ama\nHiring &#8211; join our team: https://lexfridman.com/hiring\nOther &#8211; other ways to get in touch: https://lexfridman.com/contact\nEPISODE LINKS:\nPeter&#8217;s X: https://x.com/steipete\nPeter&#8217;s GitHub: https://github.com/steipete\nPeter&#8217;s Website: https://steipete.com\nPeter&#8217;s LinkedIn: https://www.linkedin.com/in/steipete\nOpenClaw Website: https://openclaw.ai\nOpenClaw GitHub: https://github.com/openclaw/openclaw\nOpenClaw Discord: https://discord.gg/openclaw\nSPONSORS:\nTo support this podcast, check out our sponsors &#38; get discounts:\nPerplexity: AI-powered answer engine.\nGo to https://perplexity.ai/\nQuo: Phone system (calls, texts, contacts) for businesses.\nGo to https://quo.com/lex\nCodeRabbit: AI-powered code reviews.\nGo to https://coderabbit.ai/lex\nFin: AI agent for customer service.\nGo to https://fin.ai/lex\nBlitzy: AI agent for large enterprise codebases.\nGo to https://blitzy.com/lex\nShopify: Sell stuff online.\nGo to https://shopify.com/lex\nLMNT: Zero-sugar electrolyte drink mix.\nGo to https://drinkLMNT.com/lex\nOUTLINE:\n(00:00) &#8211; Introduction\n(03:51) &#8211; Sponsors, Comments, and Reflections\n(15:29) &#8211; OpenClaw origin story\n(18:48) &#8211; Mind-blowing moment\n(28:15) &#8211; Why OpenClaw went viral\n(32:12) &#8211; Self-modifying AI agent\n(36:57) &#8211; Name-change drama\n(54:07) &#8211; Moltbook saga\n(1:02:26) &#8211; OpenClaw security concerns\n(1:11:07) &#8211; How to code with AI agents\n(1:42:02) &#8211; Programming setup\n(1:48:45) &#8211; GPT Codex 5.3 vs Claude Opus 4.6\n(1:57:52) &#8211; Best AI agent for programming\n(2:19:52) &#8211; Life story and career advice\n(2:23:49) &#8211; Money and happiness\n(2:27:41) &#8211; Acquisition offers from OpenAI and Meta\n(2:44:51) &#8211; How OpenClaw works\n(2:56:09) &#8211; AI slop\n(3:02:13) &#8211; AI agents will replace 80% of apps\n(3:10:50) &#8211; Will AI replace programmers?\n(3:22:50) &#8211; Future of OpenClaw community",
      "link": "https://lexfridman.com/peter-steinberger/?utm_source=rss&utm_medium=rss&utm_campaign=peter-steinberger"
    },
    {
      "podcast": "This Week in Startups",
      "title": "Does Clawdbot (OpenClaw) Need Eyes? (feat. Alex Finn and Matt Van Horn) | E2247",
      "published": "2026-02-10",
      "summary": "This Week In Startups is made possible by:LinkedIn - http://linkedin. com/twistEvery. io - http://every. io/Northwest registered Agent - www.",
      "raw_text": "This Week In Startups is made possible by:LinkedIn - http://linkedin.com/twistEvery.io - http://every.io/Northwest registered Agent - www.northwestregisteredagent.com/twistToday’s show: Sean Liu gave his OpenClaw “eyes” by hooking the AI assistant up to his Meta Ray Bans. While Jason and Alex consider the implications… guest expert Alex Finn quickly loses interest…It’s another All-Clawdbot TWiST where we debate the most essential uses for the viral agent platform. For their part, Alex Finn and Matt Van Horn are building practical skills to help founders (esp. solo founders)… Alex has a brain trust of AI agents working round the clock to improve his organization and content, while Matt designed a skill for his agent to order sushi lunches (keeping them under $20).PLUS find out how Producer Oliver designed his “Model Council” based on Perplexity’s set-up, why running everything local is “illogical” for most people in 2026, AND why Jason’s next Founder U cohort will all be building with OpenClaw.Timestamps: (00:00) Why Jason is STILL Claw-pilled! We can’t get enough!(03:17) “Mr. Clawdbot” Alex Finn of Creator Buddy joins us! He’s Claw-Pilled too!(04:50) Sean Liu (@_seanliu) added OpenClaw to his Meta Ray Bans… Here’s why Alex doesn’t care!(8:33) Lost your job to AI? Maybe AI can make you a founder!(12:35) LinkedIn Jobs - Hire right, the first time. Post your first job and get $100 off towards your job post at http://linkedin.com/twist Terms and conditions apply.(13:34) “Last 30 Days” skill creator Matt Van Horn (@mvanhorn) joins the show(14:54) Why Jason wants to invest in Matt’s new project.(15:53) Meeting Alex’s organization of AI agents who collaborate on his projects autonomously(22:28) Is Alex planning to turn his OpenClaw set-up into a company? Maybe…(23:10) Every.io - For all of your incorporation, banking, payroll, benefits, accounting, taxes or other back-office administration needs, visit http://every.io/(25:16) Using OpenClaw to create a “lights out” startup(28:17) Deciding when to use local models vs. more powerful cloud-based models(29:52) Northwest Registered Agent. Get more when you start your business with Northwest. In 10 clicks and 10 minutes, you can form your company and walk away with a real business identity —  Learn more at www.northwestregisteredagent.com/twist(30:58) How Producer Oliver created a “Model Council” for LAUNCH based on Perplexity’s set-up(35:52) Why it’s so important to have an orchestrator that knows the right model for the right task(39:12) Why running everything local is “illogical” for most companies in 2026(41:15) Matt walks us through the latest and greatest incarnation of his “Last 30 Days” skill(45:57) Why Jason thinks recursive machine learning is the solution to human laziness(46:38) How Alex has supercharged his social media and his startup during OpenClaw Mania(50:15) Why Founder University is going ALL OPENCLAW next cohort(51:21) How big a jump over Opus 4.5 is Opus 4.6?(53:35) OpenClaw’s going to start scanning skills for malware… Will this help?(57:13) No one was SUPER impressed by the AI dot com Super Bowl ad… except JCal(1:01:11) Matt used his “Order Sushi” OpenClaw skill live on the show to get lunch(1:04:08) Polymarket’s sharps are wagering on Claude 5’s hotly anticipated releaseThank you to our partners:(12:35) LinkedIn Jobs - Hire right, the first time. Post your first job and get $100 off towards your job post at http://linkedin.com/twist Terms and conditions apply.(23:10) Every.io - For all of your incorporation, banking, payroll, benefits, accounting, taxes or other back-office administration needs, visit http://every.io/(29:52) Northwest Registered Agent. Get more when you start your business with Northwest. In 10 clicks and 10 minutes, you can form your company and walk away with a real business identity —  Learn more at www.northwestregisteredagent.com/twistCheck out all our partner offers: https://partners.launch.co/",
      "link": "https://podcasters.spotify.com/pod/show/thisweekinstartups/episodes/Does-Clawdbot-OpenClaw-Need-Eyes--feat--Alex-Finn-and-Matt-Van-Horn--E2247-e3escq4"
    }
  ],
  "papers": [
    {
      "title": "DeepSight: An All-in-One LM Safety Toolkit",
      "authors": [
        "Bo Zhang",
        "Jiaxuan Guo",
        "Lijun Li",
        "Dongrui Liu",
        "Sujin Chen"
      ],
      "abstract": "As the development of Large Models (LMs) progresses rapidly, their safety is also a priority. In current Large Language Models (LLMs) and Multimodal Large Language Models (MLLMs) safety workflow, evaluation, diagnosis, and alignment are often handled by separate tools. Specifically, safety evaluation can only locate external behavioral risks but cannot figure out internal root causes. Meanwhile, safety diagnosis often drifts from concrete risk scenarios and remains at the explainable level. In t",
      "link": "https://huggingface.co/papers/2602.12092",
      "published": "2026-02-12",
      "arxiv_id": "",
      "citation_count": null,
      "quick_summary": "As the development of Large Models (LMs) progresses rapidly, their safety is also a priority. In current Large Language Models (LLMs) and Multimodal Large Language Models (MLLMs) safety workflow, evaluation, diagnosis, and alignment are often handled by separate tools.",
      "raw_text": "As the development of Large Models (LMs) progresses rapidly, their safety is also a priority. In current Large Language Models (LLMs) and Multimodal Large Language Models (MLLMs) safety workflow, evaluation, diagnosis, and alignment are often handled by separate tools. Specifically, safety evaluation can only locate external behavioral risks but cannot figure out internal root causes. Meanwhile, safety diagnosis often drifts from concrete risk scenarios and remains at the explainable level. In t"
    },
    {
      "title": "Conversational Image Segmentation: Grounding Abstract Concepts with Scalable Supervision",
      "authors": [
        "Aadarsh Sahoo",
        "Georgia Gkioxari"
      ],
      "abstract": "Conversational image segmentation grounds abstract, intent-driven concepts into pixel-accurate masks. Prior work on referring image grounding focuses on categorical and spatial queries (e.g., \"left-most apple\") and overlooks functional and physical reasoning (e.g., \"where can I safely store the knife?\"). We address this gap and introduce Conversational Image Segmentation (CIS) and ConverSeg, a benchmark spanning entities, spatial relations, intent, affordances, functions, safety, and physical re",
      "link": "https://arxiv.org/pdf/2602.13195v1",
      "published": "2026-02-13",
      "arxiv_id": "2602.13195v1",
      "citation_count": null,
      "quick_summary": "<strong>Conversational</strong> image segmentation grounds abstract, intent-driven concepts into pixel-accurate masks. Prior work on referring image grounding focuses on categorical and spatial queries (e.",
      "raw_text": "Conversational image segmentation grounds abstract, intent-driven concepts into pixel-accurate masks. Prior work on referring image grounding focuses on categorical and spatial queries (e.g., \"left-most apple\") and overlooks functional and physical reasoning (e.g., \"where can I safely store the knife?\"). We address this gap and introduce Conversational Image Segmentation (CIS) and ConverSeg, a benchmark spanning entities, spatial relations, intent, affordances, functions, safety, and physical re"
    },
    {
      "title": "In-Context Autonomous Network Incident Response: An End-to-End Large Language Model Agent Approach",
      "authors": [
        "Yiran Gao",
        "Kim Hammar",
        "Tao Li"
      ],
      "abstract": "Rapidly evolving cyberattacks demand incident response systems that can autonomously learn and adapt to changing threats. Prior work has extensively explored the reinforcement learning approach, which involves learning response strategies through extensive simulation of the incident. While this approach can be effective, it requires handcrafted modeling of the simulator and suppresses useful semantics from raw system logs and alerts. To address these limitations, we propose to leverage large lan",
      "link": "https://arxiv.org/pdf/2602.13156v1",
      "published": "2026-02-13",
      "arxiv_id": "2602.13156v1",
      "citation_count": null,
      "quick_summary": "Rapidly evolving cyberattacks demand incident response systems that can autonomously learn and adapt to changing threats. Prior work has extensively explored the reinforcement learning approach, which involves learning response strategies through extensive simulation of the incident.",
      "raw_text": "Rapidly evolving cyberattacks demand incident response systems that can autonomously learn and adapt to changing threats. Prior work has extensively explored the reinforcement learning approach, which involves learning response strategies through extensive simulation of the incident. While this approach can be effective, it requires handcrafted modeling of the simulator and suppresses useful semantics from raw system logs and alerts. To address these limitations, we propose to leverage large lan"
    },
    {
      "title": "Realistic Face Reconstruction from Facial Embeddings via Diffusion Models",
      "authors": [
        "Dong Han",
        "Yong Li",
        "Joachim Denzler"
      ],
      "abstract": "With the advancement of face recognition (FR) systems, privacy-preserving face recognition (PPFR) systems have gained popularity for their accurate recognition, enhanced facial privacy protection, and robustness to various attacks. However, there are limited studies to further verify privacy risks by reconstructing realistic high-resolution face images from embeddings of these systems, especially for PPFR. In this work, we propose the face embedding mapping (FEM), a general framework that explor",
      "link": "https://arxiv.org/pdf/2602.13168v1",
      "published": "2026-02-13",
      "arxiv_id": "2602.13168v1",
      "citation_count": null,
      "quick_summary": "With the advancement of face recognition (FR) systems, privacy-preserving face recognition (PPFR) systems have gained popularity for their accurate recognition, enhanced facial privacy protection, and robustness to various attacks. However, there are limited studies to further verify privacy risks by reconstructing realistic high-resolution face images from embeddings of these systems, especially for PPFR.",
      "raw_text": "With the advancement of face recognition (FR) systems, privacy-preserving face recognition (PPFR) systems have gained popularity for their accurate recognition, enhanced facial privacy protection, and robustness to various attacks. However, there are limited studies to further verify privacy risks by reconstructing realistic high-resolution face images from embeddings of these systems, especially for PPFR. In this work, we propose the face embedding mapping (FEM), a general framework that explor"
    },
    {
      "title": "Bloom Filter Look-Up Tables for Private and Secure Distributed Databases in Web3 (Revised Version)",
      "authors": [
        "Shlomi Dolev",
        "Ehud Gudes",
        "Daniel Shlomo"
      ],
      "abstract": "The rapid growth of decentralized systems in theWeb3 ecosystem has introduced numerous challenges, particularly in ensuring data security, privacy, and scalability [3, 8]. These systems rely heavily on distributed architectures, requiring robust mechanisms to manage data and interactions among participants securely. One critical aspect of decentralized systems is key management, which is essential for encrypting files, securing database segments, and enabling private transactions. However, secur",
      "link": "https://arxiv.org/pdf/2602.13167v1",
      "published": "2026-02-13",
      "arxiv_id": "2602.13167v1",
      "citation_count": null,
      "quick_summary": "The rapid growth of decentralized systems in theWeb3 ecosystem has introduced numerous challenges, particularly in ensuring data security, privacy, and scalability [3, 8]. These systems rely heavily on distributed architectures, requiring robust mechanisms to manage data and interactions among participants securely.",
      "raw_text": "The rapid growth of decentralized systems in theWeb3 ecosystem has introduced numerous challenges, particularly in ensuring data security, privacy, and scalability [3, 8]. These systems rely heavily on distributed architectures, requiring robust mechanisms to manage data and interactions among participants securely. One critical aspect of decentralized systems is key management, which is essential for encrypting files, securing database segments, and enabling private transactions. However, secur"
    }
  ]
}